{
  "meta": {},
  "items": [
    {
      "itemID": "000",
      "menu_item": "VIDEO DE YOUTUBE:",
      "contenido": "VIDEO DE YOUTUBE:\n(Referencia visual del tutorial\n\nFastApi desde Cero:\n\nhttps://youtu.be/TatMVGGMxY0?si=v9opbTdJvMjhDRGk\n\ny en el repositorio:\n\nhttps://github.com/IngFabioCastellanos/api-rest-google-apps-script"
    },
    {
      "itemID": "001",
      "menu_item": "¿Qué es FastAPI y Por Qué Usarlo?",
      "contenido": "FastAPI es un **framework web moderno y rápido** de alto rendimiento, diseñado para construir APIs utilizando Python. Es considerado uno de los frameworks Python más rápidos, comparable en rendimiento con NodeJS y Go, gracias a que se basa en Starlette y Pydantic.\n\nEl lenguaje Python en sí es extremadamente versátil, utilizado en áreas como Machine Learning y desarrollo web. De entre los frameworks web disponibles, FastAPI se destaca por ser considerado por muchos como el mejor que existe hoy en día.\n\n**Ventajas clave de FastAPI:**\n\n1.  **Ultra Rápido y Eficiente:** Su instalación es muy rápida (una sola línea de código) y su ejecución requiere solo cinco líneas para un inicio básico.\n2.  **Rápido de Programar:** Aumenta la velocidad de desarrollo de funcionalidades en aproximadamente un 200% a 300%.\n3.  **Menos Errores:** Reduce hasta en un 40% los errores humanos, ya que muchas funcionalidades están implementadas automáticamente.\n4.  **Validación Automática:** Soluciona problemas comunes simplemente al **dar un tipo a los datos (tipado)**. El framework infiere la seguridad, el casteo a JSON, y maneja la sincronía, un aspecto que suele ser complejo en Python.\n5.  **Documentación Interactiva Automática:** Genera automáticamente la documentación de la API siguiendo los estándares abiertos OpenAPI (anteriormente Swagger) y JSON Schema.\n6.  **Basado en Estándares:** Está completamente basado y es compatible con los estándares abiertos para APIs.\n\n**Validación con Fuentes Técnicas Oficiales de FastAPI (Sustituto debido a la falta de Fuentes de Google Apps Script):**\n\n*   *FastAPI es rápido y de alto rendimiento:* Validado por la documentación que lo describe como un framework con muy alto rendimiento, a la par con NodeJS y Go.\n*   *FastAPI se basa en estándares:* Validado por su compatibilidad con OpenAPI y JSON Schema."
    },
    {
      "itemID": "002",
      "menu_item": "Requisitos e Instalación del Framework",
      "contenido": "Para empezar con FastAPI, solo necesitas tener conocimientos básicos de Python y ganas de aprender.\n\nFastAPI se apoya en dos librerías principales:\n*   **Starlette:** para la gestión web.\n*   **Pydantic:** para la gestión de datos y validaciones.\n\n### 1. Instalación Rápida\n\nLa instalación es ultra rápida y se realiza con una sola línea de código, ya que esta línea incluye las dependencias necesarias, como un servidor de aplicaciones Python (Uvicorn).\n\nPara obtener todas las dependencias estándar, incluyendo el servidor necesario:\n\n```bash\npip install \"fastapi[standard]\"\n```\n**Nota:** Es crucial poner `\"fastapi[standard]\"` entre comillas para asegurar que la instalación funcione correctamente en todas las terminales. Si ya eres un usuario avanzado de Python, lo ideal es crear un ambiente virtual para aislar las dependencias del proyecto.\n\n**Validación con Fuentes Técnicas Oficiales de FastAPI (Sustituto):**\n\n*   *Instalación con dependencias estándar:* Validado por la instrucción oficial de usar `pip install \"fastapi[standard]\"`, que incluye Uvicorn para el servidor."
    },
    {
      "itemID": "003",
      "menu_item": "Creación y Ejecución de la Primera Aplicación",
      "contenido": "Una vez instalado FastAPI, el siguiente paso es crear el archivo principal de tu aplicación y ejecutar el servidor.\n\n### 1. Crear el archivo de aplicación (`main.py`)\n\nCrea un archivo llamado `main.py` (aunque el nombre no es estrictamente importante, `main` es la convención preferida).\n\nEn este archivo, importamos `FastAPI`, instanciamos la aplicación y definimos nuestra primera \"ruta\" o *endpoint* (punto de acceso):\n\n```python\nfrom fastapi import FastAPI\n\n# Instanciamos la aplicación\napp = FastAPI()\n\n# Definimos el primer enrutador (endpoint) usando un decorador\n@app.get(\"/\")\ndef read_root():\n    return {\"message\": \"Hello World\"}\n```\n\n### 2. Entendiendo el Código Básico\n\n*   `FastAPI()`: Se instancia la aplicación. Esta instancia (`app`) contiene los **decoradores** que funcionan como enrutadores.\n*   `@app.get(\"/\")`: Este es un **decorador** que le dice al servidor que si llega una petición HTTP de tipo `GET` a la ruta raíz (`/`), debe ejecutar la función inmediatamente debajo de él (`read_root`).\n*   `read_root()`: Esta función devuelve un diccionario Python, que FastAPI **transforma automáticamente** en un objeto JSON para el cliente.\n\n### 3. Ejecutar el Servidor (Uvicorn)\n\nPara ejecutar la aplicación, usamos el servidor Uvicorn a través del comando `fastapi dev`. Este comando ejecuta el archivo `main` y busca la instancia de FastAPI llamada `app`.\n\n```bash\nfastapi dev main.py\n```\n\nEl servidor arrancará e indicará la dirección local (por defecto `http://127.0.0.1:8000`) y la dirección de la documentación.\n\nSi cambias cualquier cosa en el archivo y lo guardas, el comando `dev` (o `reload` si se usa Uvicorn directamente) hace que el servidor se vuelva a ejecutar automáticamente, permitiendo cambios en tiempo real, lo que ofrece una experiencia de usuario \"increíble\".\n\n**Validación con Fuentes Técnicas Oficiales de FastAPI (Sustituto):**\n\n*   *Estructura de la aplicación:* Validado por el ejemplo oficial que muestra la importación, la instanciación de `FastAPI()`, y la definición de una función con el decorador `@app.get(\"/\")` que devuelve un diccionario.\n*   *Comando de ejecución:* Validado por el uso de `fastapi dev main.py` para arrancar el servidor con Uvicorn y auto-recarga habilitada."
    },
    {
      "itemID": "004",
      "menu_item": "Tipos de Comunicación: Path, Query y Body",
      "contenido": "Todos los frameworks web se comunican mediante peticiones HTTP, enviando y recibiendo parámetros. En FastAPI, existen principalmente tres formas de enviar información a la API:\n\n1.  **Parámetros de Path (Ruta):** Variables que forman parte de la URL misma (ejemplo: `/users/10`).\n2.  **Parámetros de Query (Consulta):** Variables que se añaden después del signo de interrogación (`?`) en la URL (ejemplo: `/users?id=10`).\n3.  **Body (Cuerpo de la Petición):** Un objeto (generalmente JSON) que se envía con métodos como `POST`, `PUT` o `PATCH`.\n\nLo \"maravilloso\" de FastAPI es que no necesitas declarar si un parámetro es de `path` o `query`; el framework lo **infiere** automáticamente basándose en dónde lo defines y en su tipado.\n\n### 1. Parámetros de Path\n\nPara usar un parámetro de ruta, simplemente se encierra el nombre de la variable entre llaves `{}` en el decorador de la ruta. Este nombre debe coincidir con un argumento en la función.\n\n```python\n# La ruta espera un parámetro de path llamado 'item_id'\n@app.get(\"/items/{item_id}\")\ndef read_item(item_id: int):\n    # El framework infiere que 'item_id' es un parámetro de path\n    return {\"item_id\": item_id}\n```\n**Tipado (Inferencia de Tipo):** Al especificar el tipo de dato (`int` para `item_id`), FastAPI no solo lo valida, sino que también lo **transforma** si es necesario (ej. de string a número entero). Si no se especifica el tipo, por defecto se asume que es un `String`.\n\n### 2. Parámetros de Query\n\nSi un parámetro aparece en la función, pero **no** se especifica en la URL del decorador, el framework automáticamente infiere que debe ser un parámetro de *query*.\n\n```python\n# Ejemplo que recibe un ID por path y un parámetro 'q' por query\n@app.get(\"/items/{item_id}\")\ndef read_item(item_id: int, q: Union[str, None] = None):\n    # q es opcional (definido con \"= None\") y se busca en la query string\n    return {\"item_id\": item_id, \"q\": q}\n```\nSi se le da un valor por defecto (como `= None` o `= 10`), el parámetro de query se vuelve **opcional**. Si no se proporciona un valor por defecto, es **requerido**.\n\n### 3. Parámetros en el Body (Cuerpo)\n\nPara enviar estructuras de datos complejas (como diccionarios o JSON), utilizamos el Cuerpo de la Petición (Body). Esto solo funciona en métodos HTTP que modifican datos, como `POST`, `PUT`, `DELETE` o `PATCH`; **no funciona en peticiones `GET`**.\n\nPara cambiar el método, simplemente se usa el decorador correspondiente, por ejemplo, `@app.post` para enviar información.\n\n**Validación con Fuentes Técnicas Oficiales de FastAPI (Sustituto):**\n\n*   *Parámetros de Path:* Validado por el uso de la sintaxis `/items/{item_id}` y la necesidad de que `item_id` sea un argumento de la función.\n*   *Parámetros de Query:* Validado por la documentación que describe cómo se pueden pasar variables opcionales como `q`."
    },
    {
      "itemID": "005",
      "menu_item": "Validación de Datos con Modelos (Pydantic)",
      "contenido": "Cuando se necesita enviar estructuras de datos más complejas (no primitivas como `str` o `int`), por ejemplo, un objeto o un arreglo, el framework automáticamente espera que estos datos vengan en el *Body* de la petición.\n\nPara asegurar que los datos recibidos (el JSON) cumplan con una estructura específica (un \"contrato\") y para evitar bugs, se utilizan **Modelos de Datos**. Esto se logra fácilmente gracias a la librería **Pydantic**, que FastAPI utiliza internamente.\n\n### 1. Creación de un Modelo Base\n\nUn modelo es la representación de una entidad (como un `Usuario` o un `Item`).\n\nPara crear un modelo, importamos `BaseModel` de Pydantic y definimos una clase que herede de ella, especificando el tipo de dato de cada propiedad.\n\n```python\nfrom pydantic import BaseModel\nfrom typing import Union\nfrom fastapi import FastAPI\n\n# Definimos el modelo Item para el cuerpo de la petición (Body)\nclass Item(BaseModel):\n    name: str # Requerido (String)\n    price: float # Requerido (Flotante)\n    is_offer: Union[bool, None] = None # Opcional (Booleano)\n```\n\n### 2. Uso del Modelo en una Ruta\n\nSi la función de un *path operation* (ruta) recibe un argumento que es un modelo Pydantic (como `item: Item`), FastAPI automáticamente asume que esa información debe venir en el **Body** del request (como JSON).\n\n```python\n# Usamos el método POST para enviar datos\n@app.post(\"/items\")\ndef create_item(item: Item):\n    # FastAPI casteará el JSON entrante a un objeto 'Item' de Python\n    # Y lo transformará de nuevo a JSON al retornarlo\n    return item\n```\n\nEl framework se encarga de:\n\n1.  **Validar los datos** de entrada: Comprueba que el JSON cumple con el esquema del `BaseModel` (ej. que `price` sea un `float`).\n2.  **Castear/Transformar** el JSON recibido en un objeto Python (`Item`).\n3.  **Transformar** el objeto Python de vuelta a JSON para la respuesta.\n\n**Validación con Fuentes Técnicas Oficiales de FastAPI (Sustituto):**\n\n*   *Uso de Pydantic para el Body:* Validado por la documentación que requiere importar `BaseModel` y declarar el objeto del modelo como un parámetro de la función para manejar el cuerpo de la petición, especialmente con métodos `PUT` o `POST`."
    },
    {
      "itemID": "006",
      "menu_item": "Documentación Interactiva Automática",
      "contenido": "Una de las funcionalidades más poderosas de FastAPI es su capacidad de generar **documentación interactiva** automáticamente.\n\nSolo necesitas abrir tu navegador y acceder a la ruta `/docs` de tu API.\n\n### 1. Interfaces de Documentación\n\nFastAPI proporciona dos interfaces de documentación basadas en los estándares OpenAPI:\n\n1.  **Swagger UI:** Se accede en la ruta `/docs`. Esta interfaz permite no solo ver los *endpoints* disponibles, sino también interactuar directamente con ellos (probar la API, enviar parámetros de Path, Query y Body).\n2.  **ReDoc:** Se accede en la ruta `/redoc`.\n\nEl framework lee las especificaciones de un archivo JSON generado y construye esta interfaz, lo que permite a los desarrolladores tener una idea clara de lo que se puede hacer y qué parámetros se esperan.\n\nCuando se utiliza un modelo Pydantic (ver paso anterior), la documentación se actualiza automáticamente para reflejar los campos requeridos en el Body.\n\n**Validación con Fuentes Técnicas Oficiales de FastAPI (Sustituto):**\n\n*   *Documentación Interactiva:* Validado por la documentación que indica que, al ejecutar el servidor, la documentación interactiva (Swagger UI) está disponible en `http://127.0.0.1:8000/docs`."
    },
    {
      "itemID": "007",
      "menu_item": "Organización de Rutas en Aplicaciones Grandes",
      "contenido": "En aplicaciones más grandes, es esencial separar las responsabilidades de las entidades (ej. usuarios, facturas, compras). Poner todo en un solo archivo principal (`main.py`) no es lo ideal.\n\nFastAPI proporciona el `APIRouter` para manejar las rutas en múltiples archivos.\n\n### 1. Crear el Archivo de Rutas (Ej. `users.py`)\n\nCreamos un archivo separado, por ejemplo, `users.py`, donde se define la lógica de esa entidad.\n\n1.  Importamos `APIRouter` en lugar de `FastAPI`.\n2.  Definimos una instancia del router, por ejemplo, `router = APIRouter()`.\n3.  Todas las rutas relacionadas (como `/users`, `/users/category`) ahora usan el objeto `router` en sus decoradores.\n\n### 2. Conectar las Rutas Adicionales\n\nPara que la aplicación principal (`main.py`) reconozca y documente estas rutas externas, necesitamos importarlas y luego incluirlas en la aplicación principal.\n\nEsto se hace con el método `include_router` en la instancia principal de `FastAPI`:\n\n```python\n# En main.py\n\nfrom fastapi import FastAPI\nfrom . import users # Importamos el archivo de rutas\n\napp = FastAPI()\n\n# Incluimos el router de usuarios\napp.include_router(users.router)\n```\n\nAl hacer esto, la aplicación detecta la nueva documentación y las rutas, permitiendo organizar el código de manera modular y limpia.\n\n**Validación con Fuentes Técnicas Oficiales de FastAPI (Sustituto):**\n\n*   *Aplicaciones grandes y múltiples archivos:* La documentación oficial describe el manejo de \"Aplicaciones más grandes - Múltiples archivos\" y hace referencia al uso de `APIRouter`."
    },
    {
      "itemID": "008",
      "menu_item": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES",
      "contenido": "El tutorial se ha construido utilizando exclusivamente la información proporcionada en las fuentes sobre el framework **FastAPI** (Python).\n\n**IMPORTANTE:** Debido a que el material fuente proporcionado **no incluye documentación técnica oficial de Google Apps Script**, no fue posible validar los pasos con las fuentes técnicas de Google, como se requiere en las reglas obligatorias 2 y 5.\n\nEn su lugar, los puntos clave del tutorial fueron validados con la documentación técnica oficial de **FastAPI** (tiangolo.com), que es la única fuente técnica disponible en el contexto de esta consulta.\n\n### Resumen de Puntos Validados (FastAPI):\n\n| Concepto Validado | Fuente Técnica (Referencia) |\n| :--- | :--- |\n| **Definición y Rendimiento de FastAPI** | Framework moderno y de alto rendimiento, compatible con OpenAPI. |\n| **Instalación de Dependencias** | Se realiza con `pip install \"fastapi[standard]\"`, incluyendo dependencias como Uvicorn. |\n| **Ejecución y Comandos** | La aplicación se corre con `fastapi dev main.py` o comandos similares de Uvicorn. |\n| **Manejo de Rutas (Path y Query)** | Las rutas se definen con decoradores `@app.get` y los parámetros de Path se especifican en la URL `{item_id}`. |\n| **Uso de Pydantic y Body** | La validación del cuerpo de la petición (`Body`) se realiza creando una clase que hereda de `BaseModel`. |\n| **Documentación Automática** | La documentación interactiva (Swagger UI y ReDoc) se genera automáticamente en `/docs` y `/redoc`. |\n| **Organización de Código** | Para aplicaciones grandes, se utiliza `APIRouter` y `include_router` para estructurar las rutas. |\n\n### Enlaces Directos a las Fuentes Oficiales (FastAPI):\n\n*   **Documentación Principal de FastAPI:** https://fastapi.tiangolo.com\n*   **Sección de Instalación:** (Incluida en la documentación general)\n*   **Tutorial - Guía del Usuario (Primeros Pasos y Rutas):** (Referencia a la estructura del tutorial)\n*   **Código Fuente (GitHub):** https://github.com/fastapi/fastapi"
    }
  ]
}