{
  "meta": {},
  "items": [
    {
      "itemID": "000",
      "menu_item": "WEB ORIGINAL:",
      "contenido": "How to Bulk Add Rows to Google Sheets with Make.com\nWeb Original:\n\n[https://youtu.be/wWcqUdCBYCo?si=3EqsDrTBJ7yoB_Cx](https://youtu.be/wWcqUdCBYCo?si=3EqsDrTBJ7yoB_Cx)"
    },
    {
      "itemID": "001",
      "menu_item": "Introducción al método de bulk add",
      "contenido": "Introducción al método de bulk add:\n\nEl método de \"bulk add\" permite agregar múltiples filas a una hoja de Google Sheets en una sola operación, lo que reduce el número de llamadas a la API y mejora la eficiencia y velocidad de las automatizaciones en Make.com.[1]"
    },
    {
      "itemID": "002",
      "menu_item": "Configuración inicial: Buscar filas en Google Sheets",
      "contenido": "Configuración inicial: Buscar filas en Google Sheets:\n\n1. Agrega un módulo de Google Sheets en tu escenario.\n2. Selecciona la acción \"Search rows\".\n3. Elige la hoja de donde deseas obtener los datos (por ejemplo, \"orders\").\n4. Asegúrate de que la opción \"Table contains headers\" esté activada si tu hoja tiene encabezados.[1]"
    },
    {
      "itemID": "003",
      "menu_item": "Uso del Array Aggregator",
      "contenido": "Uso del Array Aggregator:\n\n1. Agrega un módulo de \"Array Aggregator\" en el flujo.\n2. El Array Aggregator toma todas las filas obtenidas y las agrupa en un solo conjunto de datos (bundle).\n3. Esto evita que cada fila se procese individualmente, reduciendo el número de operaciones y llamadas a la API.[1]"
    },
    {
      "itemID": "004",
      "menu_item": "Configuración del módulo Bulk Add Rows",
      "contenido": "Configuración del módulo Bulk Add Rows:\n\n1. Agrega un módulo de Google Sheets y selecciona la acción \"Bulk add rows\".\n2. Elige la hoja de destino donde quieres agregar los datos.\n3. Configura el rango de columnas (por ejemplo, A:Z) y asegúrate de que la estructura de datos coincida con la hoja de destino.\n4. Mapea los datos desde el Array Aggregator al módulo Bulk Add Rows, asegurándote de que la estructura de columnas sea correcta.[1]"
    },
    {
      "itemID": "005",
      "menu_item": "Ejecutar la automatización",
      "contenido": "Ejecutar la automatización:\n\n1. Guarda y ejecuta el escenario.\n2. Todos los datos se agregarán a la hoja de destino en una sola operación, lo que es más rápido y eficiente que agregar filas individualmente.[1]"
    },
    {
      "itemID": "006",
      "menu_item": "Ventajas del método bulk add",
      "contenido": "Ventajas del método bulk add:\n\n- Reduce el número de operaciones y llamadas a la API.\n- Ahorra costos en planes de Make.com.\n- Disminuye el riesgo de errores por límite de tasa de API.\n- Mejora la velocidad y confiabilidad de las automatizaciones.[1]"
    },
    {
      "itemID": "007",
      "menu_item": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES",
      "contenido": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES:\n\n- La documentación oficial de Make.com sobre el módulo \"Bulk add rows\" en Google Sheets confirma que permite agregar múltiples filas en una sola operación: [Make.com Google Sheets Bulk Add Rows](https://www.make.com/en/help/app/google-sheets#bulk-add-rows).[1]\n- La documentación de Make.com sobre el Array Aggregator explica cómo agrupar múltiples datos en un solo bundle: [Make.com Array Aggregator](https://www.make.com/en/help/module/array-aggregator).[1]\n- El video tutorial original y la documentación de Make.com validan el proceso descrito: [How to Bulk Add Rows to Google Sheets with Make.com](https://youtu.be/wWcqUdCBYCo?si=3EqsDrTBJ7yoB_Cx).[1]"
    }
  ]
}