{
  "meta": {},
  "items": [
    {
      "itemID": "000",
      "menu_item": "6 AIs NEEDED for Digital Products in 2026\nWEB ORIGINAL:",
      "contenido": "6 AIs NEEDED for Digital Products in 2026:\nWeb Original:\n6 AIs NEEDED for Digital Products in 2026:\nhttps://youtu.be/XilHrzfc3Jk?si=pWToqhwXFecsVnGS\n\nPRO-LIMP AUTOMATIZACION\n+34 636832005"
    },
    {
      "itemID": "001",
      "menu_item": "Introduccion sobre productos digitales e inteligencia artificial",
      "contenido": "Introduccion sobre productos digitales e inteligencia artificial:\nLa inteligencia artificial ha cambiado por completo como usamos y hacemos cosas digitales. Para el ano 2026, las seis herramientas de IA mas importantes para crear productos digitales son fundamentales de conocer. Es importante saber que herramientas existen, pero lo mas importante es saber como usarlas para hacer un producto digital de verdad.\n\nExisten muchos productos digitales, como hojas de calculo, agendas, plantillas, guias en PDF o archivos de audio. La mejor idea es convertir lo que tu sabes en un producto digital.\n\nMuchas personas que ven este video tienen conocimientos especiales que otros buscan en internet. Si juntas varias herramientas de IA, podras crear tu primer producto digital facilmente."
    },
    {
      "itemID": "002",
      "menu_item": "Herramienta 1 Creador de sitios web con IA de Hostinger",
      "contenido": "Herramienta 1 Creador de sitios web con IA de Hostinger:\nLa primera herramienta de IA que se usa es el creador de sitios web con IA de Hostinger. Se usa esta herramienta primero porque es la base donde vas a poner tu producto digital para que la gente lo vea.\n\nUna gran ventaja de Hostinger es que puedes crear hasta 50 sitios web para probar muchas ideas diferentes."
    },
    {
      "itemID": "003",
      "menu_item": "Como usar Hostinger para crear tu sitio web",
      "contenido": "Como usar Hostinger para crear tu sitio web:\nPara usar Hostinger y crear tu sitio web, sigue estos pasos:\n\nImagina que quieres vender un producto digital que ayuda a la gente a conseguir de 0 a 10,000 seguidores en Instagram.\n\nEscribe una frase simple, que se llama prompt, para que la IA cree un sitio web de una sola pagina.\n\nUn ejemplo de frase que puedes usar es: Quiero un sitio web simple de una pagina para vender un solo producto digital, que es un video para principiantes sobre como conseguir de 0 a 10,000 seguidores en Instagram.\n\nAgrega que el sitio web necesita una funcion para pagar y asi Hostinger incluira una tienda en linea.\n\nDale un nombre a la marca, por ejemplo, Instagram launchpad.\n\nHaz clic en crear un sitio web y la pagina se crea muy rapido.\n\nEl sitio web es de una sola pagina y muestra el producto de inmediato. Puedes cambiar cosas o agregar mas paginas si quieres, como un blog, contacto, o informacion sobre ti. Hostinger tambien tiene otras herramientas de IA muy utiles, como un generador de imagenes con IA, un escritor con IA para blogs, un asistente de SEO para que te encuentren en internet y un creador de logos con IA. El creador de sitios web de Hostinger sera muy usado en 2026."
    },
    {
      "itemID": "004",
      "menu_item": "Herramienta 2 Gamma",
      "contenido": "Herramienta 2 Gamma:\nLa segunda herramienta de IA es Gamma. Gamma ayuda a crear cosas de manera mas rapida. Gamma te ayuda a hacer diferentes productos digitales como libros electronicos, guias simples en PDF y la base de un producto de video con informacion. Esto es gracias a una funcion nueva llamada modo estudio."
    },
    {
      "itemID": "005",
      "menu_item": "Como usar Gamma para crear contenido",
      "contenido": "Como usar Gamma para crear contenido:\nPara usar Gamma y crear contenido, sigue estos pasos:\n\nEscribe una frase simple para pedirle a Gamma que cree el producto.\n\nUn ejemplo de frase que puedes usar es: Quiero que crees un mini producto de informacion llamado 0 a 10K seguidores en Instagram para principiantes.\n\nElige cuantas tarjetas o diapositivas quieres que tenga el video, por ejemplo, cinco.\n\nPuedes pedir que tenga mucho texto.\n\nHaz clic en generar esquema.\n\nEn este punto, puedes cambiar lo que quieras que incluya el producto, como un resumen sobre ti.\n\nElige un tema y pide que las imagenes sean ilustraciones.\n\nHaz clic en generar.\n\nSi quieres cambiar algo, puedes agregar una nueva diapositiva. O puedes usar el boton preguntar al agente para actualizar cualquier cosa con IA, sin tener que empezar de nuevo.\n\nCuando termines, haz clic en los tres puntos, luego en exportar.\n\nExporta el trabajo a un archivo PDF.\n\nGamma es gratis para probarlo, solo tienes que pagar si necesitas limites mas altos."
    },
    {
      "itemID": "006",
      "menu_item": "Herramienta 3 Dscript",
      "contenido": "Herramienta 3 Dscript:\nLa tercera herramienta de IA es Dscript. Es un editor de video en linea que usa IA. No necesitas descargar nada en tu computadora, y puedes inscribirte gratis. Dscript puede usar una voz de IA, traducir videos, crear videos cortos, editar podcasts y hacer videos animados."
    },
    {
      "itemID": "007",
      "menu_item": "Como usar Dscript para crear el video",
      "contenido": "Como usar Dscript para crear el video:\nPara convertir el producto de Gamma en un video usando Dscript, sigue estos pasos:\n\nPara convertir el producto de Gamma en un video, selecciona el boton para empezar.\n\nSube el documento PDF que acabas de exportar de Gamma.\n\nDscript crea el plan del video y genera automaticamente una voz de IA. Dscript tambien crea todo el guion completo sin que tu tengas que escribirlo.\n\nPuedes cambiar la voz de IA por tu propia voz si quieres. Se recomienda usar tu propia voz para que el producto sea mas personal."
    },
    {
      "itemID": "008",
      "menu_item": "Herramienta 4 Googles Nano Banana Generacion de Imagenes",
      "contenido": "Herramienta 4 Googles Nano Banana Generacion de Imagenes:\nLa siguiente herramienta de IA te ayuda a crear imagenes, se llama Googles Nano Banana. Esta herramienta es util para contenido de Instagram o imagenes para tu sitio web."
    },
    {
      "itemID": "009",
      "menu_item": "Como usar Nano Banana e integrar la imagen en Hostinger",
      "contenido": "Como usar Nano Banana e integrar la imagen en Hostinger:\nPara usar Nano Banana e integrar la imagen en Hostinger, sigue estos pasos:\n\nPara usar Nano Banana, ve a gemini.google.com y haz clic en crear imagen.\n\nEscribe una frase pidiendo la imagen.\n\nUn ejemplo de frase que puedes usar es: Crea una imagen profesional de muestra de producto para un producto de informacion llamado cero a 10k seguidores en Instagram.\n\nLa IA crea una imagen que puedes usar.\n\nDescarga la imagen.\n\nVuelve al sitio web de Hostinger que construiste.\n\nVe a la parte de tienda, luego a productos.\n\nReemplaza la imagen temporal con la nueva imagen de Nano Banana.\n\nPuedes editar la imagen dentro de Hostinger para, por ejemplo, cambiar el fondo a transparente o blanco.\n\nLa imagen nueva aparecera en tu sitio web."
    },
    {
      "itemID": "010",
      "menu_item": "Herramienta 5 Many Chat",
      "contenido": "Herramienta 5 Many Chat:\nLa quinta herramienta de IA es Many Chat. Es una herramienta para hacer cosas automaticas para promocionar tus productos digitales en redes sociales como Instagram.\n\nEl concepto es que mucha gente pide que comentes o envies un mensaje, que se llama DM, con una palabra especifica en Instagram. Cuando escribes esa palabra, Many Chat hace algo automaticamente y te envia un mensaje con mas detalles sobre el producto digital."
    },
    {
      "itemID": "011",
      "menu_item": "Como configurar la respuesta automatica en Many Chat",
      "contenido": "Como configurar la respuesta automatica en Many Chat:\nPara configurar la respuesta automatica en Many Chat, sigue estos pasos:\n\nEscribe en Many Chat lo que quieres.\n\nUn ejemplo de frase que puedes usar es: Quiero una respuesta automatica por mensaje directo, que se llama DM, para promover un producto que ayuda a crecer en Instagram. La palabra clave para que se active es Insta.\n\nMany Chat te hara preguntas sencillas y creara la secuencia automatica en pocos segundos.\n\nMany Chat se conecta automaticamente a tu cuenta de Instagram y ayuda a que mas personas vean tus productos."
    },
    {
      "itemID": "012",
      "menu_item": "Herramienta 6 Cualquier producto de IA de Google",
      "contenido": "Herramienta 6 Cualquier producto de IA de Google:\nLa sexta herramienta de IA es cualquier producto de IA de Google. Google tiene muchas herramientas, como Nano Banana, Google AI mode, Google Gemini, Google AI Studio y Notebook LM."
    },
    {
      "itemID": "013",
      "menu_item": "Uso de Notebook LM",
      "contenido": "Uso de Notebook LM:\nPara usar Notebook LM, sigue estos pasos:\n\nNotebook LM te ayuda a saber cuales son los mejores pasos a seguir para empezar a construir tu producto digital.\n\nPuedes escribir una frase, que se llama prompt, usando el constructor de frases de Notebook LM.\n\nPega esa frase en Notebook LM.\n\nNotebook LM te dara un proceso paso a paso para crear tu producto digital, ya sea un libro electronico o un video. Tambien puede crear una guia corta y personalizada de pasos a seguir y ayudarte a aprender sobre el tema de tu producto.\n\nMira el video que se menciona despues de este."
    },
    {
      "itemID": "014",
      "menu_item": "Preguntas y Respuestas",
      "contenido": "Preguntas y Respuestas:\n\nQue es un producto digital?\nUn producto digital es algo que se crea con informacion, como hojas de calculo, guias en PDF, plantillas o archivos de audio. La mejor opcion es convertir lo que sabes en un producto digital.\n\nCual es el primer paso para vender un producto digital?\nEl primer paso es usar el creador de sitios web con IA de Hostinger. Este es el lugar donde vas a poner tu producto para que la gente lo encuentre.\n\nQue hace la herramienta Hostinger?\nHostinger usa IA para construir sitios web rapidamente, incluso hasta 50 sitios web diferentes. Tambien tiene otras herramientas de IA como un creador de logos y un generador de imagenes.\n\nQue hace la herramienta Gamma?\nGamma ayuda a crear el contenido del producto digital, como libros electronicos, guias en PDF y la base de un producto de video. Crea diapositivas con informacion a partir de una frase simple que tu escribes. Es una herramienta gratuita para probar.\n\nComo convierto el contenido de Gamma en un video?\nUsas la herramienta Dscript, que es un editor de video en linea con IA. Solo tienes que subir el archivo PDF de Gamma y Dscript crea el plan del video, el guion completo y le anade una voz de IA.\n\nComo consigo imagenes para mi producto?\nPuedes usar Googles Nano Banana Generacion de Imagenes, que esta en gemini.google.com. Escribes lo que quieres y la IA crea la imagen, la cual puedes descargar y subir a tu tienda en Hostinger.\n\nComo puedo promocionar mi producto en redes sociales automaticamente?\nSe utiliza Many Chat, una herramienta de automatizacion. Puedes configurarla para que, cuando alguien comente o envie un mensaje con una palabra clave, Many Chat le envie un mensaje automatico con la informacion del producto.\n\nQue herramienta me ayuda a planear mi producto digital?\nPuedes usar cualquier producto de IA de Google, especialmente Notebook LM. Notebook LM te da los pasos para construir tu producto digital desde el principio y te ayuda a crear guias personalizadas."
    },
    {
      "itemID": "015",
      "menu_item": "VALIDACION CON FUENTES TECNICAS OFICIALES",
      "contenido": "VALIDACION CON FUENTES TECNICAS OFICIALES:Resumen de puntos tecnicos validados:\n\nHostinger AI Website Builder es una plataforma oficial que permite crear sitios web mediante inteligencia artificial, confirmada en la documentacion oficial de Hostinger. La herramienta genera sitios web personalizados a partir de descripciones simples del negocio. Ofrece hasta 50 sitios web en planes premium, incluye herramientas de IA integradas como generador de imagenes, escritor de IA, asistente SEO y creador de logos. Los planes comienzan desde 1.95 dolares mensuales para plan Premium y 2.75 dolares para plan Business con funciones de comercio electronico.\n\nGamma es una herramienta oficial de creacion de presentaciones con IA, confirmada en gamma.app. Permite generar presentaciones, documentos y paginas web a partir de prompts de texto. La herramienta incluye modo estudio para productos de informacion, genera esquemas automaticamente, permite edicion conversacional con IA y exportacion a PDF. Ofrece un plan gratuito con funciones basicas y planes de pago para funcionalidades avanzadas.\n\nDescript es un editor de video en linea oficial con capacidades de IA, confirmado en descript.com. Permite edicion de video basada en texto mediante transcripcion automatica, incluye funciones de voz de IA, traduccion, generacion de subtitulos, eliminacion de palabras de relleno y creacion de videos cortos. La herramienta cuenta con Underlord, un asistente de IA que puede generar scripts y editar videos automaticamente. Ofrece un plan gratuito con funciones esenciales.\n\nGoogle Gemini con Imagen 3, tambien conocido como Nano Banana, es el modelo oficial de generacion de imagenes de Google, confirmado en ai.google.dev y gemini.google.com. Genera imagenes de alta calidad desde texto, incluye renderizado avanzado de texto, esta disponible en gemini.google.com haciendo clic en crear imagen y todas las imagenes incluyen marca de agua digital SynthID para identificacion. Disponible para todos los usuarios de Gemini en version basica.\n\nManyChat es una plataforma oficial de automatizacion aprobada por Meta, confirmada en manychat.com. Permite automatizar respuestas en Instagram, WhatsApp y TikTok mediante DMs automaticos, respuestas a comentarios, replies a Stories y configuracion de palabras clave trigger. Se conecta directamente a cuentas profesionales de Instagram, Business o Creator, y ofrece un plan gratuito para comenzar con funciones basicas de automatizacion.\n\nGoogle NotebookLM es una herramienta oficial de investigacion con IA de Google Labs, confirmada en notebooklm.google y support.google.com/notebooklm. Permite subir PDF, Google Docs, Slides, URLs, videos de YouTube y archivos de audio para crear cuadernos de investigacion. Genera resumes automaticos, responde preguntas basadas en las fuentes, crea guias de estudio, FAQs, briefings y resumenes de audio tipo podcast. Disponible gratuitamente en mas de 180 regiones con soporte para mas de 80 idiomas.\n\nEnlaces directos a documentacion oficial:\n\nHostinger AI Website Builder: https://www.hostinger.com/ai-website-builder y https://support.hostinger.com/en/articles/7266945-how-to-use-hostinger-ai-website-builder\n\nGamma: https://gamma.app/ y https://help.gamma.app/en/articles/7838093-how-do-i-create-a-new-presentation-document-or-webpage-in-gamma\n\nDescript: https://www.descript.com/ y https://www.descript.com/underlord\n\nGoogle Gemini Imagen 3: https://ai.google.dev/gemini-api/docs/image-generation y https://gemini.google.com/overview/image-generation/\n\nManyChat: https://manychat.com/product/instagram y https://help.manychat.com/hc/en-us/articles/14281290924444-How-to-connect-Instagram-to-Manychat\n\nGoogle NotebookLM: https://notebooklm.google/ y https://support.google.com/notebooklm/answer/16164461\n\nReferencias a paginas de soporte oficiales:\n\nTodas las herramientas mencionadas cuentan con centros de ayuda oficiales, documentacion tecnica y recursos de aprendizaje disponibles en sus sitios web principales. Las herramientas han sido validadas como productos reales y actualmente disponibles, con informacion actualizada a diciembre de 2025.\n\n6 AIs NEEDED for Digital Products in 2026\nhttps://youtu.be/XilHrzfc3Jk?si=pWToqhwXFecsVnGS \nPRO-LIMP AUTOMATIZACION\n+34 636832005"
    },
    {
  "itemID": "016",
  "menu_item": "ESCUCHA LA EXPLICACION COMPLETA EN AUDIO",
  "contenido": "Escucha la explicación completa en audio:\n\nhttps://uszjudwrckvbadfljkti.supabase.co/storage/v1/object/public/infografias/Videos%20TUTORIALES/MMMMMMM.m4a"
}
  ]
}