{
  "meta": {},
  "items": [
    {
      "itemID": "000",
      "menu_item": "Como AUTOMATIZAR en WhatsApp con ManyChat\nWEB ORIGINAL:",
      "contenido": "Como AUTOMATIZAR en WhatsApp con ManyChat:\nWeb Original:\nComo AUTOMATIZAR en WhatsApp con ManyChat:\nhttps://youtu.be/POYx9Lo_15U?si=2lW7EXQk_iws65HV\n\nPRO-LIMP AUTOMATIZACION\n+34 636832005"
    },
    {
      "itemID": "001",
      "menu_item": "Introducción: Por qué usar un robot ayudante",
      "contenido": "Introducción: Por qué usar un robot ayudante:\nSi no respondes rápido a tus clientes, puedes perder hasta el 80% de las ventas.[1] Para evitar perder clientes por no contestar a tiempo, haremos un proceso automático usando una herramienta llamada ManyChat.[1]\n\nUsaremos mensajes creados por ti para que el cliente sienta que le responde una persona, aunque sea un robot el que contesta. Este robot podrá responder preguntas sencillas al momento."
    },
    {
      "itemID": "002",
      "menu_item": "Primeros pasos: Registro en ManyChat",
      "contenido": "Primeros pasos: Registro en ManyChat:\nAcción 1: Suscríbete y activa la campana en el canal de YouTube.\nAcción 2: Entra a ManyChat usando el enlace especial en la descripción del video.[1]\nAcción 3: Regístrate poniendo tus datos y tus redes sociales.[1]\nAcción 4: Ve a Configuración en la pantalla principal de ManyChat.[1]\nAcción 5: Busca el logo de WhatsApp en la lista de canales disponibles (junto a Instagram, TikTok y Telegram).[1]\nAcción 6: Haz clic en el botón azul de Conectar.[1]"
    },
    {
      "itemID": "003",
      "menu_item": "Eligiendo cómo conectar tu WhatsApp",
      "contenido": "Eligiendo cómo conectar tu WhatsApp:\nManyChat ofrece tres opciones para conectar:\n\nPasar tu número de WhatsApp normal (debes desconectarlo de donde lo uses ahora).[1][2]\n\nUsar un número nuevo que te da ManyChat.[1][2]\n\nConectar tu aplicación de WhatsApp Business.[1][2][3][4][5][6][7]\n\nAcción 7: Elige la opción 3 (Conectar tu aplicación de WhatsApp Business).[1] Esta opción funciona en países como México, Colombia, Argentina, Perú, Chile, Estados Unidos y Brasil. Si no estás en uno de estos países, elige la Opción 1.\nAcción 8: Asegúrate de tener la aplicación WhatsApp Business descargada en tu celular.[1]\nAcción 9: Usa la última versión de WhatsApp.[1]\nAcción 10: Haz clic en Continuar.[1][6]"
    },
    {
      "itemID": "004",
      "menu_item": "Conexión con Facebook (Meta)",
      "contenido": "Conexión con Facebook (Meta):\nAcción 11: Haz clic en Inicio de Sesión en Meta.\nAcción 12: Inicia sesión en Facebook si no lo has hecho.[1]\nAcción 13: Haz clic en Continuar y luego en Empezar.[1]\nAcción 14: Llena la información de tu empresa.[1][6]\nAcción 15: Elige la cuenta de publicidad que usarás para conectar el número.[1]\nAcción 16: Coloca la página web de tu negocio.[1] Si no tienes web, pon el enlace de tu Instagram o una página de Canva.[1]\nAcción 17: Haz clic en Siguiente.[1][6]"
    },
    {
      "itemID": "005",
      "menu_item": "Verificación y conexión final del número",
      "contenido": "Verificación y conexión final del número:\nAcción 18: Haz clic para conectar tu aplicación de WhatsApp Business existente.[1][8]\nAcción 19: Haz clic en Siguiente y escribe tu número de WhatsApp.[1]\nAcción 20: Importa tus contactos abriendo el código QR en tu celular.[1]\nAcción 21: Busca el mensaje de Facebook en tu WhatsApp.[1]\nAcción 22: Elige compartir la historia de tu chat.[1]\nAcción 23: Copia el código de acceso que te envió Facebook.[1]\nAcción 24: En ManyChat, haz clic en Siguiente.[1][6]\nAcción 25: Escanea el código QR en la pantalla de ManyChat desde tu WhatsApp y espera 45 segundos.[1]\nAcción 26: Confirma y da clic en Finalizar.[1]\nAcción 27: Responde las preguntas de configuración (para quién es la cuenta, tipo de negocio, objetivo).[1]\nAcción 28: Elige \"Decidir más tarde\" sobre guardar contactos antiguos (tiene un costo extra).[1]"
    },
    {
      "itemID": "006",
      "menu_item": "Configurando el activador de respuesta",
      "contenido": "Configurando el activador de respuesta:\nAcción 29: Haz clic en Automatización en el menú.\nAcción 30: Haz clic en Nueva Automatización.[1][9]\nAcción 31: Elige WhatsApp.[1][2][3][6][7][9][10][11][12]\nAcción 32: Haz clic en Comenzar desde cero (versión gratuita).[1]\nAcción 33: Elige empezar con un espacio en blanco.[1]\n\nPaso 1: El Disparador\nAcción 34: Elige la opción \"El usuario envía un mensaje\".[1]\nAcción 35: Escribe las palabras clave que usan los clientes para saludarte (ejemplo: \"Hola\", \"Mi nombre es\").\nAcción 36: Haz clic en Crear.[1]"
    },
    {
      "itemID": "007",
      "menu_item": "Diseñando el mensaje y botones",
      "contenido": "Diseñando el mensaje y botones:\nPaso 2: El Mensaje con Opciones\nAcción 37: Decide el primer mensaje instantáneo.\nAcción 38: Usa la opción de Texto con botones.[1]\nAcción 39: Escribe un saludo y pide al cliente que elija (Ej: \"Un gusto saludarte, elige una opción\").\nAcción 40: Añade botones como \"Quiero hablar con alguien\", \"Información del curso\", \"Tengo una duda\".[1]\n\nAcción 41: Crea respuestas diferentes para cada botón:\n\nSi eligen \"Hablar con alguien\", responde: \"Hola, soy Lau, cuéntame cómo te puedo ayudar.\"\n\nSi quieren \"Información del curso\", envía un mensaje de alegría y agrega un botón con enlace (link) a tu página web (Acción 42).[1]"
    },
    {
      "itemID": "008",
      "menu_item": "Humanizando la conversación",
      "contenido": "Humanizando la conversación:\nPaso 3: Haciendo la Respuesta Más Humana\nAcción 43: Envía una imagen si tienes una oferta o cartel.\nAcción 44: Envía un audio (nota de voz). Grábalo, guárdalo en tu computador y agrégalo para que el cliente sienta cercanía.[1]\nAcción 45: Añade un retraso (ejemplo: 30 segundos) entre mensajes para que no parezca que responde un robot demasiado rápido."
    },
    {
      "itemID": "009",
      "menu_item": "Consejos finales y reglas avanzadas",
      "contenido": "Consejos finales y reglas avanzadas:\nPaso 4: Usando Reglas\nAcción 46: Usa Condiciones para poner reglas. Ejemplo: Pedir que el cliente te siga en Instagram antes de enviarle un regalo gratis.\n\nConsejos:\n\nPiensa en las palabras exactas que usan tus clientes para configurar bien las palabras clave iniciales.[1]\n\nGraba un audio que se sienta cercano.[1]\n\nPara aprender más, se menciona la membresía \"Círculo Dharma\".[1]"
    },
    {
      "itemID": "010",
      "menu_item": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES",
      "contenido": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES:\nPara esta sección, se han consultado fuentes oficiales de ManyChat y Meta para validar los procesos técnicos descritos:\n\nResumen de puntos técnicos validados:\n\nConexión de WhatsApp Business (\"Coexistencia\"): La opción de conectar la App de WhatsApp Business manteniendo el número (Opción 3 del tutorial) es una función conocida como \"Coexistencia\".[1] ManyChat confirma que esta función está en fase BETA y tiene restricciones geográficas específicas (solo ciertos países compatibles), tal como menciona el tutorial.[1]\n\nCostos y Planes: ManyChat ofrece un plan gratuito limitado (hasta 1,000 contactos).[1][3][13] Para funciones avanzadas de WhatsApp, se requiere el plan Pro.[1][13] Además, Meta cobra por conversaciones iniciadas por el negocio después de las primeras 1,000 conversaciones de servicio gratuitas al mes.[1]\n\nRequisito de Ventana de 24 horas: El tutorial menciona responder rápido; técnicamente, esto se alinea con la política de WhatsApp Business API que permite respuestas libres dentro de una ventana de 24 horas desde el último mensaje del usuario.[1]\n\nEnlaces a documentación oficial:\n\nGuía oficial de conexión de WhatsApp en ManyChat: https://help.manychat.com\n\nPrecios y tarifas de WhatsApp Business Platform (Meta): https://business.whatsapp.com/products/business-platform/pricing\n\n\n1. YouTube (Video del tutorial):\nhttps://www.youtube.com/watch?v=POYx9Lo_15U\n\n2. ManyChat (Página oficial y producto WhatsApp):\nhttps://manychat.com/products/whatsapp\n\n3. Facebook (Meta Business Suite - Para conexión):\nhttps://business.facebook.com/\n\n4. Storylane (Guías interactivas y demos de ManyChat):\nhttps://www.storylane.io/\n\n5. TrustRadius (Reseñas y comparativas de ManyChat):\nhttps://www.trustradius.com/products/manychat/reviews\n\n6. AEvent (Integración de Webinars con ManyChat WhatsApp):\nhttps://aevent.com/help/integrations/manychat-whatsapp\n\nGoogle Search Suggestions\nDisplay of Search Suggestions is required when using Grounding with Google Search. Learn more\nManyChat WhatsApp automation storylane.io\nManyChat WhatsApp automation aevent\nManyChat WhatsApp automation trustradius\nManyChat WhatsApp automation facebook documentation\n\n\n\n[TITULO_VIDEO]\n[URL_WEB_YOUTUBE]\n[AUTOR]\n[TELEFONO]"
    }
  ]
}