{
  "meta": {},
  "items": [
    {
      "itemID": "000",
      "menu_item": "Encontrar CLIENTES POTENCIALES GRATIS_Nuevo metodo 2024 con IA\nWEB ORIGINAL:",
      "contenido": "Encontrar CLIENTES POTENCIALES GRATIS_Nuevo metodo 2024 con IA:\nWeb Original:\nEncontrar CLIENTES POTENCIALES GRATIS_Nuevo metodo 2024 con IA:\nhttps://youtu.be/Oqru1S8XUlc?si=p4FU0JKDXQ-tJD4\n\nPRO-LIMP AUTOMATIZACION\n+34 636832005"
    },
    {
      "itemID": "001",
      "menu_item": "Introducción y herramientas necesarias",
      "contenido": "Introducción y herramientas necesarias:\nEn este tutorial aprenderás a conseguir una lista especial de clientes potenciales en un programa como Excel, incluyendo sus datos, en solo unos minutos y totalmente gratis.\n\nPara realizar este proceso, necesitarás dos herramientas principales:\n\nGoogle.[1][2][3]\n\nChatGPT (funciona tanto la versión de pago como la gratuita).\n\nSi utilizas la versión gratuita de ChatGPT, tendrás que repetir los pasos más veces debido al límite de escritura, pero no te costará dinero."
    },
    {
      "itemID": "002",
      "menu_item": "Paso 1: Configurar la búsqueda en Google",
      "contenido": "Paso 1: Configurar la búsqueda en Google:\nLo primero es ir a Google y escribir un código especial en el buscador para filtrar los resultados:\n\nEscribe: site.instagram.com (esto le dice a Google que busque solo dentro de Instagram).\n\nA continuación, escribe la palabra específica que buscas entre comillas, por ejemplo: \"gimnasio\". Puedes cambiar esta palabra por cualquier otro nicho como dentistas, corredores de seguro o entrenador personal.\n\nAñade el tipo de correo electrónico que quieres encontrar, por ejemplo: \"@gmail.com\". También puedes añadir otras opciones como \"or @hotmail.com\".\n\nEscribe todo junto y presiona enter. Al principio verás pocos resultados (unos 9 perfiles aproximadamente).[2]"
    },
    {
      "itemID": "003",
      "menu_item": "Paso 2: Aumentar los resultados a 100",
      "contenido": "Paso 2: Aumentar los resultados a 100:\nPara ver muchos más resultados a la vez en lugar de solo unos pocos, debes modificar la dirección URL de la página de búsqueda:\n\nMira la dirección que está arriba de la página (la URL).\n\nVe al final de esa dirección.[4]\n\nEscribe lo siguiente: and num ig a 100\n\nPresiona enter.\n\nAhora verás que aparecen muchísimos más resultados en la lista."
    },
    {
      "itemID": "004",
      "menu_item": "Paso 3: Copiar la información de los resultados",
      "contenido": "Paso 3: Copiar la información de los resultados:\nUna vez tengas la lista ampliada de resultados:\n\nSelecciona todo el texto de la página. Puedes hacerlo presionando la tecla Control y la letra A a la vez (Control A).\n\nTambién puedes hacer clic y arrastrar el ratón desde arriba hasta abajo.\n\nCopia el texto seleccionado presionando la tecla Control y la letra C a la vez (Control C)."
    },
    {
      "itemID": "005",
      "menu_item": "Paso 4: Crear la tabla de datos con ChatGPT",
      "contenido": "Paso 4: Crear la tabla de datos con ChatGPT:\nAhora ve a ChatGPT para ordenar la información que acabas de copiar:\n\nEscribe la siguiente instrucción (prompt): \"Ordena la siguiente información en una tabla con las siguientes columnas: nombre completo, nombre de empresa, dirección web, correo electrónico, número de teléfono\".\n\nPega toda la información que copiaste de Google a continuación de la instrucción.\n\nPresiona enter.\n\nLa Inteligencia Artificial comenzará a crear la tabla paso a paso.[5] Si se detiene o solo saca algunos datos, puedes escribir: \"continúa continúa por favor\", y seguirá extrayendo más información."
    },
    {
      "itemID": "006",
      "menu_item": "Paso 5: Descargar la lista en formato CSV",
      "contenido": "Paso 5: Descargar la lista en formato CSV:\nPara poder usar estos datos en otro programa, necesitas descargar la tabla en un formato específico:\n\nDile a ChatGPT: \"Genérame una tabla en formato csv para poder descargarlo todo\".\n\nChatGPT creará un documento csv.[4][6]\n\nDescarga el archivo csv en tu ordenador."
    },
    {
      "itemID": "007",
      "menu_item": "Paso 6: Importar contactos al programa de gestión",
      "contenido": "Paso 6: Importar contactos al programa de gestión:\nUsando un programa de gestión (como High Level, que es el que se usa en el ejemplo):\n\nBusca la opción para importar contactos (\"import contacts\").[4][7][8][9]\n\nArrastra el documento csv que descargaste a esa opción.\n\nUne la información de cada columna con el campo correspondiente del programa:\n\nNombre completo con el campo \"nombre\".\n\nNombre de la empresa con el campo \"nombre de la compañía\".\n\nDirección web con el campo \"Website\".\n\nEmail con el campo \"email\".[10]\n\nNúmero de teléfono con el campo \"número de teléfono\".\n\nDale a siguiente, ponle un nombre a la subida y confirma."
    },
    {
      "itemID": "008",
      "menu_item": "Paso 7: Usar y automatizar los contactos",
      "contenido": "Paso 7: Usar y automatizar los contactos:\nUna vez importados los contactos, puedes realizar acciones de marketing:\n\nPonles una etiqueta a los contactos, por ejemplo: \"gimnasio de Zaragoza\".\n\nCrea un diseño de correo electrónico y envíalo solo a la gente que tiene esa etiqueta.\n\nPuedes añadir acciones automáticas para que el programa contacte con ellos cuando se añada una etiqueta específica (como \"cliente a contactar\").\n\nSi te interesa probar la plataforma High Level mencionada, puedes usar este enlace para una prueba gratuita de 30 días:\nLINK= https://www.gohighlevel.com/30-day-trial?fp_ref=kers-agency54"
    },
    {
      "itemID": "009",
      "menu_item": "Resumen de comandos y prompts útiles",
      "contenido": "Resumen de comandos y prompts útiles:\n\nPara Google:\nTexto para añadir al buscador:\nsite:instagram.com \"gimnasio\" \"@gmail.com\" OR \"@hotmail.com\"\n(Puedes sustituir \"instagram.com\" por linkedin, \"gimnasio\" por tu nicho, y los emails por otros dominios como @adidas.com).\n\nPara ChatGPT:\nPrompt para conseguir la tabla:\nFormatea la información siguiente en forma de tabla con las siguientes columnas: Nombre completo, Nombre de empresa, URL de su sitio web, Email, Número de teléfono:\n\nPrompt para descargar la tabla:\nGenérame una tabla en formato .csv para poder descargarlo todo"
    },
    {
      "itemID": "010",
      "menu_item": "Preguntas y Respuestas",
      "contenido": "Preguntas y Respuestas:\nPregunta: Qué aprenderé a hacer en este video\nRespuesta: Aprenderás a conseguir una lista grande con los datos de muchos clientes potenciales, como un archivo de Excel. Este método es gratis y solo toma unos minutos.\n\nPregunta: Qué programas se necesitan\nRespuesta: Se necesitan Google y ChatGPT. La versión gratuita de ChatGPT sirve, aunque puede tomar más tiempo.\n\nPregunta: Cuál es el primer paso en Google\nRespuesta: Debes ir a Google e introducir un código para buscar solo en Instagram, que es \"site.instagram.com\".\n\nPregunta: Qué información busco con el código especial\nRespuesta: Después de \"site.instagram.com\", debes buscar el tipo de negocio que te interesa, por ejemplo, \"gimnasio\" entre comillas. Puedes cambiarlo por dentistas o entrenador personal, o el nicho que quieras. También debes incluir el tipo de correo que buscas, como @gmail.com o @hotmail.com.\n\nPregunta: Cómo hago para ver más de 100 resultados a la vez\nRespuesta: Después de la primera búsqueda, debes ir a la dirección de la página (la URL). Al final, debes añadir el código \"and num ig a 100\" y presionar enter.\n\nPregunta: Después de buscar, qué hago con la información\nRespuesta: Tienes que seleccionar todo el texto de la página (por ejemplo, con Control A) y copiarlo (con Control C).\n\nPregunta: Para qué usamos ChatGPT\nRespuesta: Usamos ChatGPT para ordenar la información copiada y convertirla en una tabla.[5]\n\nPregunta: Qué le pido a ChatGPT\nRespuesta: Le pides que ordene la información en una tabla con columnas como nombre completo, nombre de empresa, dirección web, correo electrónico y número de teléfono. Luego pegas el texto que copiaste.\n\nPregunta: Qué pasa si ChatGPT no saca toda la información\nRespuesta: Si ChatGPT se queda a medias, puedes escribir \"continúa continúa por favor\" para que siga sacando más datos.\n\nPregunta: Cómo obtengo un archivo para usar en otro programa\nRespuesta: Le pides a ChatGPT que genere la tabla en un formato descargable. Le dices: \"Genérame una tabla en formato csv para poder descargarlo todo\". El archivo csv te permite usar los datos en un programa de gestión de contactos.[4][7][9]\n\nPregunta: Qué hago con el archivo csv\nRespuesta: Lo descargas y luego lo subes o lo importas a tu programa de gestión, como High Level.[7][9]\n\nPregunta: Cómo subo los contactos al programa\nRespuesta: Buscas la opción para importar contactos y arrastras el documento.[4] Debes asegurarte de vincular cada dato copiado (nombre, email, etc.) con el campo correcto en el programa.[7]\n\nPregunta: Qué puedo hacer con estos nuevos contactos\nRespuesta: Puedes ponerles una etiqueta, por ejemplo, \"gimnasio de Zaragoza\". Luego, puedes crear campañas de correo electrónico y enviarlas solo a los contactos que tienen esa etiqueta.\n\nPregunta: Qué significa \"automatizar\" los contactos\nRespuesta: Significa añadir una acción automática en tu programa. Esta acción hace que, cuando se añade un contacto con una etiqueta específica, el programa automáticamente le envía correos. El programa puede cambiar lo que hace dependiendo de si el cliente abre el correo o si responde.\n\nPregunta: Cómo se llama la plataforma de gestión que se usa en el video\nRespuesta: Se llama High Level.\n\nPregunta: Dónde puedo conseguir una prueba de esa plataforma\nRespuesta: Hay un enlace en la descripción del video que ofrece 30 días para probar High Level gratis."
    },
    {
      "itemID": "011",
      "menu_item": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES",
      "contenido": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES:\nPara esta sección, se han buscado fuentes técnicas para validar el método descrito.\n\nResumen de puntos técnicos validados:\n\nOperadores de búsqueda de Google (Google Dorks): El uso del comando site:instagram.com combinado con palabras clave y correos electrónicos (ej. \"@gmail.com\") es una técnica válida conocida como \"Google Dorking\" para filtrar resultados indexados públicamente.\n\nReferencia soporte Google Search: LINK= https://support.google.com/websearch/answer/2466433\n\nParámetro de URL para resultados (num=100): El tutorial menciona añadir \"and num ig a 100\" a la URL.[11] Técnicamente, el parámetro histórico correcto para mostrar 100 resultados en Google es &num=100.[1][2][12] Sin embargo, fuentes técnicas recientes indican que Google ha empezado a deshabilitar o limitar este parámetro en 2025, por lo que es posible que en algunos casos no funcione como se espera y se deban usar los ajustes de búsqueda estándar.\n\nReferencia técnica SEO sobre parámetro num=100: LINK= https://moz.com/learn/seo/search-parameters\n\nConversión de Texto a CSV con ChatGPT: La capacidad de los LLM (como ChatGPT) para analizar texto no estructurado y formatearlo como CSV para su descarga es una funcionalidad documentada y válida.\n\nReferencia OpenAI (Capacidades de análisis de datos): LINK= https://openai.com/chatgpt/features\n\nImportación de contactos en HighLevel: El proceso de importar archivos CSV y mapear campos (nombre, email, teléfono) descrito en el tutorial coincide con la documentación oficial de la plataforma HighLevel.\n\nGuía oficial de importación HighLevel: LINK= https://help.gohighlevel.com/support/solutions/articles/48000980313-how-to-import-contacts"
    }
  ]
}