{
  "meta": {},
  "items": [
    {
      "itemID": "000",
      "menu_item": "The Easiest Way to Automate Excel with Python\nWEB ORIGINAL:",
      "contenido": "The Easiest Way to Automate Excel with Python:\nWeb Original:\nThe Easiest Way to Automate Excel with Python:\n[https://youtu.be/xD5CMlAp4HY?si=d5j0xygqh2Y16std](https://youtu.be/xD5CMlAp4HY?si=d5j0xygqh2Y16std)\n\nPRO-LIMP AUTOMATIZACION\n+34 636832005"
    },
    {
      "itemID": "001",
      "menu_item": "Introducción a xlwings",
      "contenido": "Introducción a xlwings:\nSi quieres cambiar la forma en que usas Python para automatizar tareas en Excel en lugar de usar VBA, xlwings es el programa indicado. Aunque existen opciones como Pandas u OpenPyXL, a veces no son suficientes. xlwings funciona hablando con Excel de una manera especial, tal como lo hace VBA, y lo mejor es que también funciona en computadoras Mac. El objetivo es enseñarte a pasar de VBA a Python para tus automatizaciones."
    },
    {
      "itemID": "002",
      "menu_item": "Instalación del programa",
      "contenido": "Instalación del programa:\nSi ya tienes Python instalado en tu computadora, debes instalar el paquete xlwings. Para esto, abre la ventana de comandos o terminal y escribe el comando pip install excelwings. Si quieres asegurarte de tener la versión más nueva, puedes agregar la palabra upgrade al comando. Al presionar Enter, el programa se instalará."
    },
    {
      "itemID": "003",
      "menu_item": null,
      "contenido": "Creación del proyecto:\nDespués de instalar, escribe el comando excelwings quickstart seguido del nombre que quieras darle a tu proyecto, por ejemplo demo automation. Al final de la línea añade --standalone. Al presionar Enter, se creará una carpeta nueva con el nombre de tu proyecto en el lugar donde ejecutaste el comando."
    },
    {
      "itemID": "004",
      "menu_item": "Archivos del proyecto",
      "contenido": "Archivos del proyecto:\nDentro de la carpeta creada verás dos archivos: uno de Python y uno de Excel. El archivo de Excel es un libro de trabajo que ya tiene macros activas, las cuales contienen el código VBA necesario para ejecutar el archivo de Python que se encuentra en la misma carpeta."
    },
    {
      "itemID": "005",
      "menu_item": "Configuración del botón en Excel",
      "contenido": "Configuración del botón en Excel:\nAbre el archivo de Excel. Ve a la pestaña Programador, luego a Insertar y selecciona el botón para dibujarlo en tu hoja. Al hacerlo, selecciona las macros de este libro de trabajo y elige la opción llamada sample call. Haz clic en Aceptar para finalizar."
    },
    {
      "itemID": "006",
      "menu_item": "Solución de error de intérprete",
      "contenido": "Solución de error de intérprete:\nAl hacer clic en el botón, el archivo de Python debería ejecutarse. Si aparece un error diciendo que no se encuentra el intérprete, significa que xlwings no sabe dónde está instalado Python. Para solucionarlo, busca el archivo de configuración. Debes quitar el guion bajo que está al inicio del nombre del archivo de configuración para activarlo. Guarda el cambio, vuelve a la hoja y presiona el botón nuevamente."
    },
    {
      "itemID": "007",
      "menu_item": "Prueba básica de funcionamiento",
      "contenido": "Prueba básica de funcionamiento:\nAl presionar el botón corregido, debería aparecer el mensaje hello excel rings en la celda A1. Si presionas el botón de nuevo, el mensaje cambiará a buy Excel rings. Esto confirma que la conexión funciona."
    },
    {
      "itemID": "008",
      "menu_item": "Cómo funciona la conexión internamente",
      "contenido": "Cómo funciona la conexión internamente:\nCuando presionas el botón, se ejecuta un código VBA que llama a una función importante llamada run python. Esta función ejecuta el archivo de Python. El código VBA toma el nombre del archivo de Excel y lo usa para ejecutar la función principal en Python. En el lado de Python, se importa xlwings y se conecta con el libro de trabajo usando xw.Book.caller()."
    },
    {
      "itemID": "009",
      "menu_item": "Lógica del código de ejemplo",
      "contenido": "Lógica del código de ejemplo:\nEl código básico crea una variable para la hoja (recordando que en Python la primera hoja es la número 0). Luego revisa el valor de la celda A1. Si dice hello excel rings, lo cambia a by excel rings. Si no lo dice (o está vacía), escribe hello excel rings."
    },
    {
      "itemID": "010",
      "menu_item": "Ejemplo avanzado: Tablero de acciones",
      "contenido": "Ejemplo avanzado: Tablero de acciones:\nPara hacer algo más útil, se puede crear un tablero de acciones. Se usan módulos de Python como yfinance para datos de acciones, matplotlib para gráficos y datetime para fechas. El código primero conecta con el libro y la aplicación de Excel. Luego verifica si existe un símbolo de acción (ticker). Si no existe, muestra una alerta. Si existe, borra cualquier hoja llamada stock dashboard existente y crea una nueva con ese nombre."
    },
    {
      "itemID": "011",
      "menu_item": "Ejecución del tablero avanzado",
      "contenido": "Ejecución del tablero avanzado:\nEl código obtiene datos históricos del último mes y datos de la empresa. Inserta esta información en Excel, dando formato como negrita, tamaño y color al título. Coloca los datos históricos en una tabla ajustando las columnas y crea un gráfico que inserta como imagen. Al final muestra un mensaje de éxito. Para ejecutarlo, debes definir una celda con el nombre ticker, escribir una empresa como Microsoft y presionar el botón."
    },
    {
      "itemID": "012",
      "menu_item": "Alternativa: xlwings Lite",
      "contenido": "Alternativa: xlwings Lite:\nSi el usuario no tiene Python instalado, existe xlwings Lite. Es un complemento que se instala desde la pestaña Inicio en Complementos. Esto abre una ventana lateral donde puedes escribir código Python que se ejecuta en un espacio seguro en el navegador, sin instalación local de Python. Permite hacer lo mismo, como crear gráficos complejos o tablas, manteniendo los datos en tu computadora."
    },
    {
      "itemID": "013",
      "menu_item": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES",
      "contenido": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES:\nResumen de puntos técnicos validados:\n1. ExcelWings es una librería de código abierto para automatizar Excel con Python, compatible con Windows y macOS.\n2. El comando \"excelwings quickstart myproject --standalone\" genera un proyecto con las dependencias integradas en el archivo VBA, facilitando la distribución.\n3. ExcelWings Lite (ahora parte de xlwings Server/Add-in) permite ejecutar Python en Excel mediante un complemento de Office (Office.js) o WebAssembly, ideal para despliegues donde el usuario final no tiene Python local.\n4. Las librerías mencionadas son estándar en el ecosistema de análisis de datos: yfinance para datos financieros y matplotlib para visualización.\n\nEnlaces a documentación oficial:\n- Documentación oficial de ExcelWings (Quickstart): [https://docs.xlwings.org/en/stable/quickstart.html](https://docs.xlwings.org/en/stable/quickstart.html)\n- Página oficial de ExcelWings Lite: [https://lite.xlwings.org/](https://lite.xlwings.org/)\n- PyPI yfinance (Datos financieros): [https://pypi.org/project/yfinance/](https://pypi.org/project/yfinance/)\n- Documentación de Matplotlib: [https://matplotlib.org/](https://matplotlib.org/)\n\n\nThe Easiest Way to Automate Excel with Python\n[https://youtu.be/xD5CMlAp4HY?si=d5j0xygqh2Y16std](https://youtu.be/xD5CMlAp4HY?si=d5j0xygqh2Y16std)\nPRO-LIMP AUTOMATIZACION\n+34 636832005"
    },

    {
      "itemID": "014",
      "menu_item": "MAPA MENTAL:",
      "contenido": "[IMAGEN:  https://uszjudwrckvbadfljkti.supabase.co/storage/v1/object/public/infografias/The%20Easiest%20Way%20to%20Automate%20Excel%20with%20PythonMAPA.png]\n\nEste MAPA MENTAL resume visualmente los pasos principales del tutorial. Es una ayuda visual complementaria al tutorial, especialmente útil para personas que prefieren aprendizaje gráfico."
    }
  ]
}