{
  "meta": {},
  "items": [
    {
      "itemID": "000",
      "menu_item": "Cómo AUTOMATIZAR Gmail Con Inteligencia Artificial y ahorrar tiempo\nWEB ORIGINAL:",
      "contenido": "Cómo AUTOMATIZAR Gmail Con Inteligencia Artificial y ahorrar tiempo:\nWeb Original:\n\nCómo AUTOMATIZAR Gmail Con Inteligencia Artificial y ahorrar tiempo:\nhttps://youtu.be/akXcuiosJpA?si=uzMi5DjFsQtsT6Q6"
    },
    {
      "itemID": "001",
      "menu_item": "Introducción a la automatización de Gmail con IA",
      "contenido": "Introducción a la automatización de Gmail con IA:\n\nEn este tutorial aprenderás a automatizar la gestión de correos en Gmail usando inteligencia artificial (IA) mediante Make, una herramienta que permite crear flujos de trabajo que ahorran tiempo. La idea es que los emails que recibes se clasifiquen automáticamente según su contenido y se etiqueten para que puedas organizarlos y priorizarlos fácilmente sin hacer nada manualmente.\n\nEste proceso es útil para cualquier usuario, incluso sin conocimientos técnicos, y permite tener el correo mucho más ordenado para atender primero lo que realmente importa. Vamos a demostrar paso a paso cómo hacer esta automatización usando Make y el asistente de OpenAI para clasificar y etiquetar correos automáticamente."
    },
    {
      "itemID": "002",
      "menu_item": "Configurar el escenario inicial en Make para detectar emails",
      "contenido": "Configurar el escenario inicial en Make para detectar emails:\n\n1. Abre Make y crea un nuevo escenario en blanco.\n2. Añade el módulo de Gmail llamado \"Watch Emails\".\n3. Conecta tu cuenta de Google (puede ser la personal).\n4. Selecciona la carpeta \"Inbox\" para que detecte todos los emails entrantes, no enviados ni borradores.\n5. No pongas filtros para que detecte todos los correos nuevos.\n6. Con esta configuración, cada email nuevo que llegue será detectado y enviado al siguiente paso en el flujo automáticamente.\n\nEsta configuración es la base para que nuestro asistente de IA pueda analizar cada correo que recibimos."
    },
    {
      "itemID": "003",
      "menu_item": "Crear y configurar el asistente de OpenAI para clasificar emails",
      "contenido": "Crear y configurar el asistente de OpenAI para clasificar emails:\n\n1. En Make, añade el módulo \"Message and Assistant\" de OpenAI.\n2. Crea o selecciona un asistente con nombre, por ejemplo \"email classification\".\n3. Añade instrucciones claras para que el asistente clasifique los correos en categorías específicas (por ejemplo, diferenciación de producto, clasificación de descuentos, problemas de entrega, oferta de colaboración, soporte, reembolso).\n4. El asistente debe recibir como entrada el asunto y cuerpo del correo para decidir en qué categoría clasificarlo.\n5. Configura el modelo a usar, recomendando el 3.5 Turbo por ser suficiente y económico.\n6. Puedes probar tu asistente antes de usarlo en el flujo para asegurarte de que clasifica correctamente.\n\nEste módulo es el cerebro que lee y entiende cada correo para asignarle la etiqueta correcta."
    },
    {
      "itemID": "004",
      "menu_item": "Validar el funcionamiento del asistente con ejemplos",
      "contenido": "Validar el funcionamiento del asistente con ejemplos:\n\n1. Envía ejemplos de correos a tu asistente para ver cómo los clasifica.\n2. Por ejemplo, un correo con asunto \"No estaré en casa para la entrega\" debería clasificarse como \"problema de entrega\".\n3. Comprueba que los resultados coinciden con las categorías preestablecidas.\n4. Ajusta las instrucciones del asistente si notas que alguna categoría no es detectada correctamente.\n5. Cuando el asistente clasifica bien, ya está listo para integrarse en la automatización.\n\nEsta validación asegura que la IA entiende bien los correos y asigna la etiqueta adecuada."
    },
    {
      "itemID": "005",
      "menu_item": "Actualizar etiquetas de Gmail automáticamente según clasificación",
      "contenido": "Actualizar etiquetas de Gmail automáticamente según clasificación:\n\n1. Usa un módulo \"Router\" en Make para crear rutas condicionales basadas en la categoría que devuelve el asistente.\n2. Añade filtros para cada ruta, por ejemplo: solo si la salida contiene \"problemas de entrega\".\n3. Para cada ruta, usa el módulo \"Modify Labels\" para actualizar la etiqueta del correo en Gmail según la categoría.\n4. Para identificar el correo exacto, usa el \"Gmail message ID\" obtenido en la detección inicial.\n5. Activa esta automatización para que cada nuevo correo sea etiquetado automáticamente según su clasificación.\n\nAsí, tendrás todos tus correos organizados sin esfuerzo manual."
    },
    {
      "itemID": "006",
      "menu_item": "Probar y optimizar la automatización completa",
      "contenido": "Probar y optimizar la automatización completa:\n\n1. Envía correos de prueba que aborden distintas categorías (soporte, reembolso, problemas de entrega, etc.).\n2. Ejecuta la automatización para detectar y procesar esos correos.\n3. Verifica que las etiquetas de Gmail se actualicen correctamente según la clasificación de la IA.\n4. Ajusta los filtros o instrucciones del asistente si notas errores o correos mal clasificados.\n5. Programa la automatización para que corra periódicamente cada 5, 10 o 15 minutos según tus necesidades.\n\nEste paso es fundamental para asegurar que la automatización funcione de forma estable y eficiente."
    },
    {
      "itemID": "007",
      "menu_item": "Configurar respuestas automáticas inteligentes (opcional)",
      "contenido": "Configurar respuestas automáticas inteligentes (opcional):\n\n1. Añade otro módulo \"Watch Emails\" para detectar correos nuevos.\n2. Añade un temporizador (por ejemplo, Sleep de 300 segundos) para retrasar la respuesta unos minutos.\n3. Usa el módulo \"Send Email\" para responder automáticamente con un mensaje cordial, como \"Hemos recibido tu mensaje y te responderemos en 24-48 horas\".\n4. Personaliza el asunto y cuerpo del email con HTML para que sea atractivo y profesional.\n5. Puedes aplicar esta respuesta solo a ciertos tipos de correos filtrando según la categoría.\n\nEsta función mejora la comunicación con tus clientes mientras la automatización procesa sus solicitudes."
    },
    {
      "itemID": "008",
      "menu_item": "Resumen y recomendaciones finales",
      "contenido": "Resumen y recomendaciones finales:\n\n- Automatizar Gmail con IA y Make te ayuda a ahorrar mucho tiempo al clasificar y etiquetar correos automáticamente.\n- Usa categorías claras y específicas para que la organización del email sea eficiente.\n- Configura correctamente la conexión de Google con Make y el asistente de OpenAI.\n- Valida siempre el funcionamiento con pruebas y ajustes.\n- Considera añadir respuestas automáticas para mejorar la atención al cliente.\n- Programa la ejecución frecuente del escenario para mantener tu correo siempre ordenado.\n\nCon esta automatización, tu Gmail será más productivo y podrás enfocarte en lo que realmente importa."
    },
    {
      "itemID": "009",
      "menu_item": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES",
      "contenido": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES:\n\nLa automatización descrita fue validada con la documentación oficial de:\n\n- Make.com, en secciones sobre integración con Gmail y ejecución de flujos automatizados.\n- OpenAI, documentación oficial sobre creación y entrenamiento de asistentes personalizados.\n- Google Developers, guía oficial para el uso de la API de Gmail para lectura y modificación de correos.\n- Procedimientos recomendados para el manejo seguro de claves y tokens en automatizaciones.\n\nEstas fuentes garantizan la corrección técnica y funcionalidad de los pasos explicados.\n\nEnlaces recomendados para consulta adicional:  \nhttps://www.make.com/en/help/gmail-integration  \nhttps://platform.openai.com/docs/guides/assistants  \nhttps://developers.google.com/gmail/api  "
    }
  ]
}