{
  "meta": {},
  "items": [
    {
      "itemID": "000",
      "menu_item": "This Hidden Excel Button Saves HOURS\nWEB ORIGINAL:",
      "contenido": "This Hidden Excel Button Saves HOURS:\nWeb Original:\nThis Hidden Excel Button Saves HOURS:\nhttps://youtu.be/zEbbB_al47M?si=ftbEI22T4a01Q7Pq"
    },
    {
      "itemID": "001",
      "menu_item": "Introducción a la grabadora de macros",
      "contenido": "Introducción a la grabadora de macros:\nExcel tiene un botón especial que te ayuda a hacer cosas automáticamente y ahorra mucho tiempo. Se llama la grabadora de macros. Puedes usarla con un programa de inteligencia artificial como ChatGPT para quitar tareas aburridas en Excel y trabajar como un experto. Por ejemplo, si tienes datos de pedidos cada semana, puedes limpiar los datos y hacer un informe bonito con solo un clic. El informe tiene un título, una fecha, una tabla con datos y un formato especial si la cantidad es mayor a cierto número. Limpiar datos manualmente toma tiempo, es aburrido y puede tener errores. Con la grabadora, haces todo automático."
    },
    {
      "itemID": "002",
      "menu_item": "Activar la pestaña Desarrollador",
      "contenido": "Activar la pestaña Desarrollador:\nHay una pestaña escondida en Excel llamada Desarrollador. Si no la ves, está apagada por defecto. Para encenderla, haz clic derecho en cualquier parte de la barra de arriba donde están las opciones, y elige personalizar la cinta. Busca la casilla de Desarrollador, que probablemente no está marcada. Márcala y haz clic en aceptar. Ahora verás la pestaña Desarrollador con botones para macros."
    },
    {
      "itemID": "003",
      "menu_item": "Qué es una macro",
      "contenido": "Qué es una macro:\nUna macro es como una lista de pasos automáticos que Excel hace por ti. Puedes escribir el código tú mismo o usar la grabadora para que Excel grabe lo que haces. Vamos a usar la grabadora primero."
    },
    {
      "itemID": "004",
      "menu_item": "Grabar una macro",
      "contenido": "Grabar una macro:\nVe a la hoja con los datos. En la pestaña Desarrollador, haz clic en grabar macro. Sale una ventana. Dale un nombre a la macro, como preparar_datos. No uses espacios, usa guion bajo. Elige guardar en el libro de macros personal. Haz clic en aceptar. Ahora el botón dice detener grabación, y Excel graba todo lo que hagas."
    },
    {
      "itemID": "005",
      "menu_item": "Convertir datos en tabla",
      "contenido": "Convertir datos en tabla:\nSelecciona una celda en los datos. Ve a la pestaña Insertar y elige Tabla. Confirma el rango y haz clic en aceptar. Esto hace una tabla de Excel."
    },
    {
      "itemID": "006",
      "menu_item": "Insertar filas para título",
      "contenido": "Insertar filas para título:\nPara dejar espacio arriba, selecciona la primera fila, haz clic derecho y elige insertar. Hazlo tres veces para tener tres filas vacías."
    },
    {
      "itemID": "007",
      "menu_item": "Añadir título y fecha",
      "contenido": "Añadir título y fecha:\nEn la celda A1, escribe el título. Cambia la fuente a tamaño 16 y negrita. En otra celda, escribe fecha. Al lado, usa la fórmula =TODAY() para la fecha de hoy. Copia con Control C, y pega solo valores con Control Shift V para que quede fija."
    },
    {
      "itemID": "008",
      "menu_item": "Ordenar la tabla",
      "contenido": "Ordenar la tabla:\nOrdena por la columna que quieras, como ID de producto. Elige de A a Z."
    },
    {
      "itemID": "009",
      "menu_item": "Aplicar formato condicional",
      "contenido": "Aplicar formato condicional:\nSelecciona la columna Cantidad. En la pestaña Inicio, elige Formato Condicional, Resaltar Reglas de Celdas, Mayor que. Escribe 8, elige un color como rojo, y acepta."
    },
    {
      "itemID": "010",
      "menu_item": "Detener la grabación",
      "contenido": "Detener la grabación:\nVe a la pestaña Desarrollador y haz clic en detener grabación."
    },
    {
      "itemID": "011",
      "menu_item": "Ver el código",
      "contenido": "Ver el código:\nHaz clic en Visual Basic o Alt F11. En el editor, busca el libro personal.xlsb, módulo uno, y verás el código de la macro."
    },
    {
      "itemID": "012",
      "menu_item": "Probar la macro",
      "contenido": "Probar la macro:\nAbre otro archivo con datos nuevos. En Desarrollador, haz clic en macros o Alt F8. Elige la macro y ejecuta. Hace todo automático."
    },
    {
      "itemID": "013",
      "menu_item": "Problemas con referencias fijas",
      "contenido": "Problemas con referencias fijas:\nLa macro puede no incluir todas las filas nuevas porque usa números fijos en el código, como hasta fila 64. También depende del nombre de la hoja."
    },
    {
      "itemID": "014",
      "menu_item": "Usar IA para mejorar el código",
      "contenido": "Usar IA para mejorar el código:\nCopia el código. Ve a ChatGPT o similar. Dile que tienes código de macro y quieres hacerlo flexible. Responde sus preguntas. Pega el nuevo código en el editor, cambia el nombre si es igual. Prueba en datos nuevos, ahora incluye todo."
    },
    {
      "itemID": "015",
      "menu_item": "Libro de macros personal",
      "contenido": "Libro de macros personal:\nEste libro se abre siempre con Excel, así las macros están disponibles en cualquier archivo. Puedes añadir botones a la cinta para ejecutarlas."
    },
    {
      "itemID": "016",
      "menu_item": "Conclusión",
      "contenido": "Conclusión:\nUsa la grabadora primero, luego IA para limpiar el código. Ahorra tiempo y es flexible. No es perfecto, pero ayuda mucho.\n\n\nVALIDACIÓN CON FUENTES TÉCNICAS OFICIALES\n- Activar pestaña Desarrollador: Validado en documentación oficial de Microsoft. Enlace: https://support.microsoft.com/en-us/office/show-the-developer-tab-e1192344-5e56-4d45-931b-e5fd9bea2d45\n- Grabar una macro: Validado en documentación oficial de Microsoft. Enlace: https://support.microsoft.com/en-us/office/automate-tasks-with-the-macro-recorder-974ef220-f716-4e01-b015-3ea70e64937b\n- Libro de macros personal: Validado en documentación oficial de Microsoft. Enlace: https://support.microsoft.com/en-us/office/create-and-save-all-your-macros-in-a-single-workbook-66c97ab3-11c2-44db-b021-ae005a9bc790\n- Ver y editar código VBA: Validado en documentación oficial de Microsoft. Enlace: https://support.microsoft.com/en-us/office/edit-a-macro-ed9e8c3d-58fd-47a1-83eb-bdee680376bb\n- Formato condicional: Validado en documentación oficial de Microsoft. Enlace: https://support.microsoft.com/en-us/office/use-conditional-formatting-to-highlight-information-in-excel-fed60dfa-1d3f-4e13-9ecb-f1951ff89d7f\n- Convertir datos en tabla: Validado en documentación oficial de Microsoft. Enlace: https://support.microsoft.com/en-us/office/create-and-format-tables-e81aa349-b006-4f8a-9806-5af9df0ac664\n- Ordenar datos: Validado en documentación oficial de Microsoft. Enlace: https://support.microsoft.com/en-us/office/sort-data-in-a-range-or-table-in-excel-62d0b95d-2a90-4610-a6ae-2e545c4a4654\n- Fórmula TODAY: Validado en documentación oficial de Microsoft. Enlace: https://support.microsoft.com/en-us/office/today-function-5eb3078d-a82c-4736-8930-2f51a028fdd9\n- Pegar valores: Validado en documentación oficial de Microsoft. Enlace: https://support.microsoft.com/en-us/office/paste-options-8ea795b0-87cd-46af-9b59-ed4d8b1669ad\n- Ejecutar macro: Validado en documentación oficial de Microsoft. Enlace: https://support.microsoft.com/en-us/office/run-a-macro-in-excel-5e855fd2-02d1-45f5-90a3-50e645fe3155\n- Uso de IA con Excel: Microsoft ofrece herramientas como Copilot para asistir en VBA, validado en: https://www.microsoft.com/en-us/microsoft-365/excel/ai-for-excel"
    }
  ]
}