{
  "meta": {},
  "items": [
    {
      "itemID": "000",
      "menu_item": "Crea aplicaciones increíbles sin programar: Conecta Airtable y Make\nWEB ORIGINAL:",
      "contenido": "Crea aplicaciones increíbles sin programar: Conecta Airtable y Make :\nWeb Original:\n\nCrea aplicaciones increíbles sin programar - Conecta Airtable y Make :\nhttps://youtu.be/qiUEmLjDcnM?si=bMRfOBAR_9RwFjrm"
    },
    {
      "itemID": "001",
      "menu_item": "Introducción: ¿Qué son Airtable y Make y qué lograremos juntos?",
      "contenido": "Introducción: ¿Qué son Airtable y Make y qué lograremos juntos?:\n\nEn este tutorial, aprenderás a conectar dos herramientas muy potentes: Airtable, que funciona como una hoja de cálculo supervitaminada y una base de datos flexible, y Make (antes conocido como Integromat), una plataforma que te permite automatizar tareas y conectar diferentes aplicaciones sin necesidad de escribir una sola línea de código.[1][2]\n\nEl objetivo es crear una automatización simple pero muy útil: cada vez que añadamos una nueva fila (un registro) en una tabla de Airtable, esa misma información se enviará y se guardará automáticamente en una hoja de cálculo de Google Sheets. Esto te abrirá un mundo de posibilidades para automatizar tus flujos de trabajo."
    },
    {
      "itemID": "002",
      "menu_item": "Paso 1: Preparando nuestras herramientas",
      "contenido": "Paso 1: Preparando nuestras herramientas:\n\nAntes de empezar, asegúrate de tener todo lo necesario:\n\nUna cuenta de Airtable: Si no tienes una, puedes crearla gratuitamente. Dentro de Airtable, crea una nueva \"Base\" desde cero. Para este ejemplo, la llamaremos \"Mi Base de Clientes\".\n\nDentro de \"Mi Base de Clientes\", renombra la tabla por defecto a \"Clientes\" y crea tres columnas sencillas:\n\nNombre (campo de tipo \"Single line text\")\n\nEmail (campo de tipo \"Email\")\n\nFecha de registro (campo de tipo \"Date\")\n\nUna cuenta de Make: También puedes registrarte de forma gratuita en su página web.\n\nUna cuenta de Google: Necesitarás una para poder usar Google Sheets. Crea una nueva hoja de cálculo en Google Drive y llámala \"Registro de Clientes\".\n\nEn la hoja de cálculo \"Registro de Clientes\", crea tres columnas en la primera fila que se correspondan con las de Airtable: Nombre, Email y Fecha de registro."
    },
    {
      "itemID": "003",
      "menu_item": "Paso 2: Creando la conexión entre Airtable y Make (Método OAuth)",
      "contenido": "Paso 2: Creando la conexión entre Airtable y Make (Método OAuth):\n\nPara que Make pueda \"hablar\" con Airtable de forma segura, necesitamos crear una conexión. Usaremos el método más moderno y seguro llamado OAuth.[2][3]\n\nVe al Hub de Desarrolladores de Airtable: Dentro de tu cuenta de Airtable, haz clic en tu icono de perfil (arriba a la derecha) y selecciona \"Developer hub\".\n\nCrea una nueva integración OAuth: En el menú de la izquierda, selecciona \"OAuth integrations\" y haz clic en el botón \"Register a new OAuth integration\".\n\nRellena los datos de la integración:\n\nApplication name: Dale un nombre descriptivo, como \"Conexión Make\".\n\nRedirect URL: Este paso es crucial. Make te proporciona una URL específica que debes pegar aquí. La documentación oficial de Make indica que la URL es https://www.make.com/oauth/cb/airtable.[2]\n\nGenera el \"Client Secret\": Haz clic en \"Generate client secret\". Verás que aparecen dos códigos: el Client ID y el Client Secret. Mantenlos a mano, ya que los necesitarás en un momento. Importante: El \"Client Secret\" solo se muestra una vez, así que cópialo en un lugar seguro.[2][3]\n\nDefine los permisos (Scopes): Un poco más abajo, en la sección de \"Scopes\", debes indicar a qué podrá acceder Make. Marca las siguientes casillas:\n\ndata.records:read (para leer registros)\n\ndata.records:write (para escribir registros)\n\nschema.bases:read (para leer la estructura de tus bases)\n\nGuarda los cambios: Haz clic en el botón \"Save changes\" en la parte inferior."
    },
    {
      "itemID": "004",
      "menu_item": "Paso 3: Creando nuestro primer escenario en Make",
      "contenido": "Paso 3: Creando nuestro primer escenario en Make:\n\nUn \"escenario\" en Make es como una receta para una automatización.[4][5] Vamos a crear uno que se active cuando haya un nuevo registro en Airtable.\n\nInicia sesión en Make y ve a la sección \"Scenarios\" en el menú de la izquierda.\n\nCrea un nuevo escenario: Haz clic en el botón \"Create a new scenario\".\n\nAñade el primer módulo (Airtable): En el centro de la pantalla, verás un gran círculo con un signo de más. Haz clic en él y busca \"Airtable\". Selecciónalo de la lista.\n\nElige el \"disparador\" (Trigger): Un disparador es la acción que inicia la automatización. Selecciona \"Watch Records\". Esta opción hará que el escenario se ejecute cada vez que se cree o actualice un registro.\n\nConfigura la conexión de Airtable en Make:\n\nAparecerá una ventana para configurar la conexión. Haz clic en el botón \"Add\".\n\nSelecciona la opción de conexión \"OAuth 2.0\".[3]\n\nAhora, pega el Client ID y el Client Secret que obtuviste de Airtable en los campos correspondientes.[2]\n\nHaz clic en \"Save\". Se abrirá una ventana de Airtable pidiéndote que autorices la conexión. Concede el acceso a las bases que necesites (puedes darle acceso a todas).\n\nSelecciona la Base y la Tabla: Una vez conectado, Make te pedirá que elijas la \"Base\" (Mi Base de Clientes) y la \"Table\" (Clientes) que quieres vigilar. También te pedirá un \"Trigger Field\", que es el campo que indica cuándo se ha modificado un registro (puedes usar el campo \"Last Modified Time\" que Airtable suele tener por defecto, o tu campo \"Fecha de registro\").\n\nDefine desde dónde empezar: Make te preguntará desde qué registro empezar. Puedes elegir \"From now on\" para que solo procese los registros nuevos que se creen a partir de este momento."
    },
    {
      "itemID": "005",
      "menu_item": "Paso 4: Añadiendo la acción de Google Sheets",
      "contenido": "Paso 4: Añadiendo la acción de Google Sheets:\n\nAhora que nuestro escenario se activa correctamente, vamos a decirle qué hacer: añadir los datos a Google Sheets.\n\nAñade un nuevo módulo: Pasa el ratón sobre el lado derecho del módulo de Airtable y haz clic en el signo de más que aparece.\n\nBusca y selecciona Google Sheets: En la lista de aplicaciones, busca \"Google Sheets\" y selecciónalo.\n\nElige la acción: Queremos añadir una nueva fila, así que elige la acción \"Add a Row\".[6]\n\nConecta tu cuenta de Google: Al igual que con Airtable, haz clic en \"Add\" para crear una conexión. Se abrirá una ventana de Google pidiéndote que inicies sesión y permitas que Make acceda a tus hojas de cálculo. Simplemente sigue los pasos y acepta los permisos.\n\nConfigura la acción \"Add a Row\":\n\nSelect Spreadsheet and Sheet: Make te mostrará una lista de tus archivos de Google Drive. Busca y selecciona tu hoja de cálculo \"Registro de Clientes\" y la hoja correspondiente (normalmente \"Hoja 1\").\n\nMap the Data: Este es el paso mágico. Make detectará automáticamente las columnas de tu hoja de Google (Nombre, Email, Fecha de registro). Para cada columna, tienes que \"mapear\" o asignar el dato que viene de Airtable. Al hacer clic en cada campo, se desplegará un panel con los datos del módulo de Airtable. Simplemente haz clic en el dato correspondiente (ej. para la columna \"Nombre\" de Google Sheets, selecciona el campo \"Nombre\" que viene de Airtable).\n\nConfirma y guarda: Una vez que hayas mapeado todos los campos, haz clic en \"OK\"."
    },
    {
      "itemID": "006",
      "menu_item": "Paso 5: Probando y activando nuestra automatización",
      "contenido": "Paso 5: Probando y activando nuestra automatización:\n\nYa casi hemos terminado. Solo falta comprobar que todo funciona como esperamos.\n\nGuarda el escenario: Es una buena práctica guardar tu progreso haciendo clic en el icono del disquete en la parte inferior izquierda.\n\nEjecuta una prueba: Haz clic en el botón \"Run once\" en la esquina inferior izquierda. El escenario se quedará \"escuchando\" a que ocurra algo en Airtable.\n\nAñade un nuevo registro en Airtable: Ve a tu tabla \"Clientes\" en Airtable y añade una nueva fila con un nombre, un email y una fecha de ejemplo.\n\nObserva la magia: Vuelve a Make. Verás que los módulos se iluminan y aparecen unas burbujas con un número \"1\". Esto significa que la automatización ha detectado el nuevo registro, lo ha procesado y lo ha enviado a Google Sheets.\n\nVerifica el resultado: Abre tu hoja de cálculo \"Registro de Clientes\" en Google Drive. ¡La nueva fila que añadiste en Airtable debería estar allí!\n\nActiva el escenario: Si todo ha funcionado correctamente, activa el interruptor de \"Scheduling\" en la parte inferior izquierda para que ponga \"ON\". A partir de este momento, tu automatización se ejecutará automáticamente cada vez que añadas un nuevo registro a Airtable, sin que tengas que hacer nada más."
    },
    {
      "itemID": "007",
      "menu_item": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES",
      "contenido": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES:\n\nEste tutorial ha sido creado siguiendo las directrices y procedimientos validados por la documentación oficial de ambas plataformas.\n\nConexión de Airtable y Make: El método de conexión a través de OAuth 2.0 es el recomendado por Make para una integración segura y escalable. Los pasos para crear la integración, obtener el Client ID y el Client Secret, y definir los scopes se basan en las guías de integración de Airtable para desarrolladores y los documentos de ayuda de Make.\n\nFuente oficial de Airtable API: https://airtable.com/developers/web/api\n\nDocumentación de Make para la integración con Airtable: https://www.make.com/en/integrations/airtable\n\nCreación de Escenarios en Make: La estructura del flujo de trabajo, utilizando un módulo \"Trigger\" (disparador) como \"Watch Records\" y un módulo \"Action\" (acción) como \"Add a Row\", es el procedimiento estándar para la creación de automatizaciones en Make.\n\nCentro de ayuda de Make (documentación general): https://www.make.com/en/help/[5]\n\nIntegración con Google Sheets: La conexión y el uso del módulo de Google Sheets, incluyendo la acción \"Add a Row\" y el mapeo de datos, se corresponden con las indicaciones proporcionadas en la documentación de Make para esta aplicación.\n\nDocumentación de Make para la integración con Google Sheets: https://www.make.com/en/integrations/google-sheets[3]"
    }
  ]
}