{
  "meta": {},
  "items": [
    {
      "itemID": "000",
      "menu_item": "How to Connect a Telegram Bot to Make.com (Beginner Guide)\nWEB ORIGINAL:",
      "contenido": "How to Connect a Telegram Bot to Make.com (Beginner Guide):\nWeb Original:\n\nHow to Connect a Telegram Bot to Make.com (Beginner Guide):\nhttps://youtu.be/8TMKfSDORAc?si=4DScmSIOgE8UMekF"
    },
    {
      "itemID": "001",
      "menu_item": "Introducción y requisitos previos",
      "contenido": "Introducción y requisitos previos:\n\nEn este tutorial aprenderás cómo conectar un bot de Telegram a la plataforma Make.com (antes conocida como Integromat) para automatizar mensajes y acciones. No se requieren conocimientos técnicos avanzados, solo seguir cada paso detalladamente.\n\nRequisitos previos:\n- Tener una cuenta activa en Telegram.\n- Crear un bot en Telegram usando BotFather.\n- Cuenta activa en Make.com para crear escenarios.\n- Navegador web para acceder a ambas plataformas.\n\nEsta guía te llevará de la mano desde la creación del bot hasta su conexión exitosa en Make.com validando cada paso con documentación oficial."
    },
    {
      "itemID": "002",
      "menu_item": "Paso 1: Crear un bot en Telegram con BotFather",
      "contenido": "Paso 1: Crear un bot en Telegram con BotFather:\n\n1. Abre Telegram y busca el usuario @BotFather.\n2. Inicia una conversación y envía el comando /newbot para crear un nuevo bot.\n3. Elige un nombre para tu bot y envía.\n4. Define un nombre de usuario único que termine en \"bot\" (por ejemplo: midemo_bot).\n5. BotFather te proporcionará un token de acceso (una cadena larga de letras y números). \n   Guarda este token; será necesario para conectar el bot con Make.com.\n\nEste procedimiento está detallado en la documentación oficial de Telegram para desarrolladores: https://core.telegram.org/bots#6-botfather "
    },
    {
      "itemID": "003",
      "menu_item": "Paso 2: Configurar la cuenta de Make.com e iniciar un escenario nuevo",
      "contenido": "Paso 2: Configurar la cuenta de Make.com e iniciar un escenario nuevo:\n\n1. Accede a Make.com y crea una cuenta si no tienes una.\n2. En el panel principal, haz clic en \"Create a new scenario\" (Crear un nuevo escenario).\n3. Usa el buscador para encontrar y añadir el módulo \"Telegram Bot\".\n4. Selecciona la acción que quieres realizar, como \"Watch updates\" para recibir mensajes o \"Send a message\" para enviar mensajes.\n\nEsta integración oficial la describe Make.com en su documentación sobre módulos de Telegram: https://www.make.com/en/integrations/telegram "
    },
    {
      "itemID": "004",
      "menu_item": "Paso 3: Conectar el bot de Telegram a Make.com con el token",
      "contenido": "Paso 3: Conectar el bot de Telegram a Make.com con el token:\n\n1. Cuando añades el módulo \"Telegram Bot\", Make.com te pedirá que crees o selecciones una conexión.\n2. Selecciona \"Add\" para agregar una nueva conexión.\n3. Introduce el token de acceso que proporcionó BotFather en Telegram.\n4. Guarda la conexión y pruébala para asegurarte de que Make.com puede comunicarse con tu bot.\n\nEste paso es esencial y está descrito en el apartado \"Authenticating to Telegram Bot API\" en la API oficial de Telegram: https://core.telegram.org/bots/api#authorizing-your-bot "
    },
    {
      "itemID": "005",
      "menu_item": "Paso 4: Crear una automatización simple en Make.com",
      "contenido": "Paso 4: Crear una automatización simple en Make.com:\n\n1. Añade un módulo \"Telegram Bot\" con la acción \"Watch Updates\" para detectar mensajes enviados a tu bot.\n2. Añade un módulo \"Telegram Bot\" con la acción \"Send a Message\".\n3. Conecta la salida del primer módulo a la entrada del segundo.\n4. Configura el mensaje de respuesta personalizado que quieras enviar.\n5. Ejecuta la prueba y activa el escenario.\n6. Envía un mensaje a tu bot en Telegram y verifica que responde automáticamente.\n\nEsta configuración sencilla está explicada en la guía oficial de Make.com para integrar Telegram Bots: https://www.make.com/en/help/integrations/telegram "
    },
    {
      "itemID": "006",
      "menu_item": "Consejos y mejores prácticas para la conexión",
      "contenido": "Consejos y mejores prácticas para la conexión:\n\n- Guarda siempre el token de tu bot en un lugar seguro y no lo compartas públicamente.\n- Usa escenarios de prueba en Make.com para validar el flujo antes de publicar automatizaciones en producción.\n- Consulta regularmente la documentación oficial para actualizar acciones o cambios en la API según Telegram y Make.com.\n- Considera agregar filtros en tus escenarios para responder solo a mensajes específicos, optimizando la automatización.\n\nEstas prácticas se basan en las recomendaciones oficiales y buenas prácticas de seguridad para bots y automatizaciones: https://core.telegram.org/bots/faq y https://www.make.com/en/help/best-practices "
    },
    {
      "itemID": "007",
      "menu_item": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES",
      "contenido": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES:\n\n- Creación y obtención del token del bot Telegram por BotFather validado en la documentación oficial de Telegram Bot API: https://core.telegram.org/bots#6-botfather y https://core.telegram.org/bots/api#authorizing-your-bot .\n- Uso e integración del módulo Telegram Bot en Make.com validado en su centro de ayuda oficial: https://www.make.com/en/help/integrations/telegram y https://www.make.com/en/integrations/telegram .\n- Procedimientos de conexión, autenticación y prueba comprobados siguiendo guías oficiales para garantizar la seguridad y funcionalidad.\n\nEstas fuentes garantizan que los pasos presentados son actuales, oficiales y probados para conectar correctamente un bot de Telegram a Make.com."
    }
  ]
}