{
  "meta": {},
  "items": [
    {
      "itemID": "000",
      "menu_item": "Telegram Bot with Memory in Make\nWEB ORIGINAL:",
      "contenido": "Telegram Bot with Memory in Make:\nWeb Original:\n\nTelegram Bot with Memory in Make\n(Sin URL disponible)"
    },
    {
      "itemID": "001",
      "menu_item": "Introducción: ¿Por qué un Bot de Telegram con Memoria?",
      "contenido": "Introducción: ¿Por qué un Bot de Telegram con Memoria?:\n\nEn este tutorial, exploraremos cómo construir un bot de Telegram utilizando la plataforma Make (anteriormente Integromat) y la Inteligencia Artificial (IA) para dotarlo de memoria. Los bots de texto tradicionales a menudo carecen de la capacidad de recordar conversaciones pasadas o información relevante. Esto limita su utilidad a interacciones puntuales y sencillas.\n\nEl objetivo es superar esta limitación añadiendo dos tipos de memoria:\n\n1.  **Memoria a Corto Plazo:** Para recordar los mensajes más recientes en una conversación, permitiendo un diálogo fluido y contextual.\n2.  **Memoria a Largo Plazo:** Para almacenar y recuperar información importante que el bot debe recordar indefinidamente, actuando como un asistente personal que toma notas.\n\nEste tutorial se basa en un bot de Telegram ya configurado. Si aún no tienes un bot de Telegram básico funcionando en Make, se recomienda consultar tutoriales previos sobre cómo configurar uno. Continuaremos a partir de un bot de texto que ya interactúa con una IA para responder mensajes.\n\nEl problema que resolveremos es que, en un escenario básico, la IA procesa cada mensaje de forma aislada, sin \"recordar\" nada de lo que se ha dicho anteriormente, lo cual impide mantener una conversación coherente o retener información clave."
    },
    {
      "itemID": "002",
      "menu_item": "Componentes Clave del Escenario en Make",
      "contenido": "Componentes Clave del Escenario en Make:\n\nPara implementar la memoria en nuestro bot de Telegram, utilizaremos varios módulos y herramientas dentro de la plataforma Make, integrando la potencia de la IA.\n\nLos componentes principales que se añadirán al escenario existente son:\n\n1.  **Google Docs (para Memoria a Largo Plazo):**\n    *   Se usará un documento de Google para almacenar información crucial que la IA debe recordar por un tiempo prolongado. Piense en ello como el cuaderno de notas del bot.\n    *   Módulos de Make a utilizar:\n        *   \"Insertar un párrafo en un documento\": Para guardar la nueva información importante.\n        *   \"Obtener el contenido de un documento\": Para que la IA consulte la memoria a largo plazo antes de responder.\n\n2.  **Make Data Store (para Memoria a Corto Plazo):**\n    *   Este componente nativo de Make es ideal para almacenar datos temporales o de sesión, como el último mensaje del usuario y la última respuesta del asistente.\n    *   Módulo de Make a utilizar:\n        *   \"Obtener un registro\": Para recuperar el historial de la conversación más reciente.\n        *   \"Añadir/Actualizar un registro\": Para guardar el nuevo turno de conversación.\n\n3.  **Módulos de IA (OpenAI, etc.):**\n    *   Además del asistente personal principal, se introducirán módulos de IA adicionales con roles específicos:\n        *   **IA Tomadora de Decisiones:** Determinará si la información de una interacción es lo suficientemente importante como para ser almacenada en la memoria a largo plazo.\n        *   **IA de Contexto:** Consultará la memoria a largo plazo para extraer información relevante antes de que el asistente principal formule una respuesta.\n\n4.  **Enrutador (Router) en Make:**\n    *   Este módulo es fundamental para dirigir el flujo de información en el escenario. Se utilizará para bifurcar el proceso según la decisión de la IA (por ejemplo, si la información es importante o no)."
    },
    {
      "itemID": "003",
      "menu_item": "Implementando la Memoria a Largo Plazo con Google Docs",
      "contenido": "Implementando la Memoria a Largo Plazo con Google Docs:\n\nLa memoria a largo plazo permite a nuestro bot recordar información importante indefinidamente. Utilizaremos Google Docs para este propósito.\n\n1.  **La IA Tomadora de Decisiones:**\n    *   Configura un módulo de IA (por ejemplo, OpenAI) en Make. Este módulo actuará como un \"sistema\" o \"rol\" dentro de tu escenario.\n    *   Su `prompt` (instrucción) debe convertir a la IA en una tomadora de decisiones. La instrucción clave es que decida si la información que recibe es importante o no para recordar a largo plazo.\n    *   La entrada para esta IA debe incluir tanto el mensaje que el usuario envió al bot como la respuesta que el asistente personal de IA generó.\n    *   La IA solo debe responder con \"sí\" o \"no\".\n\n2.  **El Enrutador (Router) para la Decisión:**\n    *   Conecta la salida de la IA tomadora de decisiones a un módulo de \"Enrutador\" en Make.\n    *   Crea dos rutas a partir del enrutador:\n        *   **Ruta 1 (No Importante):**\n            *   Añade un filtro a esta ruta que se active si la respuesta de la IA tomadora de decisiones es \"no\".\n            *   Esta ruta simplemente enviará la respuesta original del asistente personal de vuelta al bot de Telegram. No se guardará nada en la memoria a largo plazo.\n        *   **Ruta 2 (Importante):**\n            *   Añade un filtro a esta ruta que se active si la respuesta de la IA tomadora de decisiones es \"sí\".\n            *   Esta ruta procederá a guardar la información en Google Docs.\n\n3.  **Guardando Información Importante en Google Docs:**\n    *   En la Ruta 2 (Importante), añade otro módulo de IA.\n    *   Instruye a esta IA para que, si la información es importante, extraiga palabras clave, escriba un resumen corto y lo genere como un texto conciso (por ejemplo, \"reunión de trabajo 24 de agosto\").\n    *   La entrada para esta IA es nuevamente el mensaje original del usuario y la respuesta del asistente.\n    *   Conecta la salida de esta IA a un módulo de Google Docs \"Insertar un párrafo en un documento\".\n    *   Configura este módulo para que inserte el resumen generado por la IA en un documento específico de Google Docs que servirá como tu memoria a largo plazo. Puedes usar un documento sencillo que liste los puntos clave.\n\n4.  **Recuperando la Memoria a Largo Plazo:**\n    *   Al inicio del escenario, justo después de que el bot de Telegram recibe un mensaje, añade un módulo de Google Docs \"Obtener el contenido de un documento\".\n    *   Configura este módulo para que lea el mismo documento de Google Docs que usas para almacenar la memoria a largo plazo.\n    *   Conecta la salida de este módulo a una nueva IA \"de contexto\" (otro módulo de IA).\n    *   Esta IA de contexto leerá el documento de Google y buscará si hay alguna \"información útil para el mensaje que acabo de enviar en Telegram\".\n    *   En su `prompt`, instruye a esta IA para que busque información coincidente. Si encuentra algo, que lo genere. Si no, que responda \"no hay memoria registrada sobre este tema\".\n    *   La salida de esta IA de contexto (la información relevante de la memoria a largo plazo) se pasará al asistente personal principal para que la considere al formular su respuesta.\n\n5.  **Reglas Especiales para la Memoria a Largo Plazo:**\n    *   **Evitar Duplicados:** Añade una regla lógica o un filtro adicional para que si la IA de contexto ya encontró y generó información sobre un tema (\"reunión colega 1 de septiembre\"), la IA tomadora de decisiones no intente guardarla de nuevo. Esto se puede hacer con un filtro que compruebe si la información ya está presente en el documento de Google Docs antes de insertarla nuevamente.\n    *   **Forzar Memorización:** Si el usuario incluye frases como \"recuerda\", \"memoriza\" o \"ten en cuenta siempre\" en su mensaje, esto debe anular la decisión de la IA de que algo no es importante. Puedes añadir un filtro condicional en el enrutador o un `prompt` específico en la IA tomadora de decisiones para que, si detecta estas palabras clave, siempre genere un \"sí\" y fuerce el almacenamiento. Esto evita llenar Google Docs con información trivial y ahorrar créditos de IA, pero permite al usuario decidir qué es importante."
    },
    {
      "itemID": "004",
      "menu_item": "Implementando la Memoria a Corto Plazo con Make Data Store",
      "contenido": "Implementando la Memoria a Corto Plazo con Make Data Store:\n\nLa memoria a corto plazo es esencial para mantener la coherencia en una conversación, permitiendo al bot recordar el contexto inmediato de los últimos intercambios. Para esto, utilizaremos los \"Data Stores\" integrados en Make.\n\n1.  **Accediendo a Data Stores en Make:**\n    *   En el panel de control de Make, haz clic en \"Más\" (More) y luego en \"Data Stores\".\n    *   Si no tienes un Data Store creado, puedes configurarlo fácilmente. Necesitarás definir la estructura de los datos que almacenarás (por ejemplo, un campo para el mensaje del usuario y otro para la respuesta del asistente).\n\n2.  **Recuperando la Memoria a Corto Plazo al Inicio:**\n    *   Justo después de que se recibe el mensaje del bot de Telegram y después de recuperar la memoria a largo plazo (Google Docs), añade un módulo de \"Data Store\" en Make con la acción \"Obtener un registro\" (Get a record).\n    *   Configura este módulo para buscar datos con una clave específica, por ejemplo, `short_memory`. Esta clave identificará el registro que contiene la última conversación.\n    *   La salida de este módulo (`short_memory`), que contendrá el último mensaje del usuario y la última respuesta del asistente, se pasará al asistente personal principal.\n\n3.  **Integrando la Memoria a Corto Plazo en el Asistente Principal:**\n    *   El `prompt` del módulo de IA que actúa como tu asistente personal debe ser actualizado para incluir la información de la memoria a corto plazo.\n    *   Puedes añadir una sección al `prompt` como: \"Este fue el último mensaje entre nosotros; yo dije: [último mensaje del usuario] y él dijo: [última respuesta del asistente]\".\n    *   Además, asegúrate de que la información extraída de la memoria a largo plazo (Google Docs) también se incluya en este `prompt`.\n    *   De esta manera, tu asistente personal tendrá acceso a mucha información contextual: el mensaje actual del usuario, el historial reciente de la conversación y cualquier información importante almacenada a largo plazo.\n\n4.  **Guardando la Nueva Memoria a Corto Plazo:**\n    *   Después de que el asistente personal de IA ha generado su respuesta y antes de enviarla de vuelta a Telegram (y después de la lógica de decisión de la memoria a largo plazo), añade otro módulo de \"Data Store\" con la acción \"Añadir/Actualizar un registro\" (Add/Update a record).\n    *   Configura este módulo para guardar:\n        *   El mensaje actual del usuario.\n        *   La respuesta generada por el asistente personal.\n    *   Usa la misma clave (`short_memory`) para actualizar el registro existente. De esta forma, el \"Data Store\" siempre contendrá el último turno de conversación."
    },
    {
      "itemID": "005",
      "menu_item": "Flujo Completo del Escenario del Bot de Telegram con Memoria",
      "contenido": "Flujo Completo del Escenario del Bot de Telegram con Memoria:\n\nAhora que hemos cubierto la implementación de la memoria a corto y largo plazo, veamos el flujo completo del escenario en Make, paso a paso, desde que el bot recibe un mensaje hasta que envía una respuesta:\n\n1.  **Recepción del Mensaje de Telegram:**\n    *   Un módulo de \"Telegram Bot\" recibe un nuevo mensaje de texto del usuario.\n\n2.  **Consulta de Memoria a Largo Plazo (Google Docs):**\n    *   Un módulo de Google Docs \"Obtener el contenido de un documento\" lee el documento de memoria a largo plazo.\n    *   Una IA de contexto analiza este contenido junto con el mensaje actual para extraer cualquier información útil relevante. Esta información se pasará al asistente personal.\n\n3.  **Consulta de Memoria a Corto Plazo (Make Data Store):**\n    *   Un módulo de \"Data Store\" \"Obtener un registro\" recupera el último mensaje del usuario y la última respuesta del asistente (utilizando la clave `short_memory`). Esta información también se pasará al asistente personal.\n\n4.  **Procesamiento por el Asistente Personal de IA:**\n    *   Un módulo de IA (el asistente principal) recibe:\n        *   El mensaje actual del usuario.\n        *   La información relevante de la memoria a largo plazo.\n        *   El contexto de la última conversación de la memoria a corto plazo.\n    *   Basado en toda esta información, el asistente genera una respuesta inteligente y contextualizada.\n\n5.  **Decisión de Almacenamiento a Largo Plazo:**\n    *   Una IA tomadora de decisiones evalúa si la interacción actual (mensaje del usuario + respuesta del asistente) contiene información lo suficientemente importante como para ser guardada en la memoria a largo plazo. Responde con \"sí\" o \"no\".\n\n6.  **Enrutamiento de la Respuesta:**\n    *   Un módulo \"Enrutador\" dirige el flujo:\n        *   **Ruta \"No Importante\":** Si la IA tomadora de decisiones dijo \"no\", la respuesta del asistente se envía directamente al usuario en Telegram.\n        *   **Ruta \"Importante\":** Si la IA tomadora de decisiones dijo \"sí\":\n            *   Una IA adicional resume la información clave de la interacción.\n            *   Un módulo de Google Docs \"Insertar un párrafo en un documento\" añade este resumen al documento de memoria a largo plazo.\n            *   Luego, la respuesta del asistente se envía al usuario en Telegram.\n\n7.  **Actualización de Memoria a Corto Plazo:**\n    *   Un módulo de \"Data Store\" \"Añadir/Actualizar un registro\" guarda el mensaje actual del usuario y la respuesta del asistente, actualizando el registro de `short_memory` para la próxima interacción.\n\nEste flujo permite que el bot no solo responda de manera inteligente, sino que también aprenda de las conversaciones pasadas y mantenga un contexto continuo, haciendo que la interacción sea mucho más natural y útil."
    },
    {
      "itemID": "006",
      "menu_item": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES",
      "contenido": "VALIDACIÓN CON FUENTES TÉCNICAS OFICIALES:\n\nEste tutorial describe un enfoque práctico para construir un bot de Telegram con memoria utilizando la plataforma Make y servicios de IA. Los conceptos y módulos mencionados se basan en funcionalidades estándar y ampliamente documentadas de las herramientas utilizadas.\n\nPuntos clave del tutorial:\n*   **Integración de Telegram:** Utiliza los módulos de bot de Telegram de Make para recibir y enviar mensajes, que interactúan con la API de Telegram.\n*   **Gestión de IA Conversacional:** Emplea servicios de IA (como la API de OpenAI) para procesar lenguaje natural, generar respuestas y tomar decisiones basadas en `prompts` específicos. La técnica de `prompting` para definir roles y comportamientos de la IA es fundamental.\n*   **Memoria a Largo Plazo con Google Docs:** Se utiliza un documento de Google como una base de datos de texto para almacenar y recuperar información persistente. Make ofrece módulos para interactuar con Google Docs (leer y escribir contenido).\n*   **Memoria a Corto Plazo con Make Data Stores:** Los Data Stores son una funcionalidad nativa de Make diseñada para almacenar datos estructurados dentro de escenarios. Son ideales para guardar estados de conversación o información temporal.\n*   **Flujo de Control con Enrutadores y Filtros:** Make proporciona herramientas potentes como los Enrutadores y los Filtros para controlar la lógica del flujo de datos en un escenario, permitiendo bifurcaciones condicionales y procesamiento diferenciado.\n\nReferencias y fuentes técnicas:\n1.  **Make (Integromat) Documentation:**\n    *   Make Official Documentation: [https://www.make.com/en/help/](https://www.make.com/en/help/)\n    *   Make Data Stores: [https://www.make.com/en/help/features/data-stores](https://www.make.com/en/help/features/data-stores)\n    *   Make Google Docs Modules: [https://www.make.com/en/integrations/google-docs](https://www.make.com/en/integrations/google-docs)\n    *   Make Telegram Bot Modules: [https://www.make.com/en/integrations/telegram-bot](https://www.make.com/en/integrations/telegram-bot)\n    *   Make OpenAI Modules: [https://www.make.com/en/integrations/openai](https://www.make.com/en/integrations/openai)\n2.  **Telegram Bot API Documentation:**\n    *   Official Telegram Bot API: [https://core.telegram.org/bots/api](https://core.telegram.org/bots/api)\n3.  **OpenAI API Documentation:**\n    *   OpenAI Platform Documentation (GPT models, `prompting` techniques): [https://platform.openai.com/docs/api-reference](https://platform.openai.com/docs/api-reference)"
    }
  ]
}